programming/c/code/algorithms.org
#+Title: Algorithms in C
#+OPTIONS: ^:nil num:nil author:nil email:nil creator:nil timestamp:nil

* Chapter 1. Introduction

** Program 1.1 Quick-find solution to connectivity problem

#+BEGIN_SRC c :tangle 1-1-quick-find.c
  #include <stdio.h>
  #define N 10000

  main()
  {
      int i, p, q, t, id[N];
      for (i = 0; i < N; i++)
          id[i] = i;
      while (scanf("%d %d\n", &p, &q) == 2) {
          if (id[p] == id[q])
              continue;
          for (t = id[p], i = 0; i < N; i++)
              if (id[i] == t)
                  id[i] = id[q];
          printf(" %d %d\n", p, q);
      }
  }
#+END_SRC

** Program 1.2 Quick-union solution to connectivity problem

#+BEGIN_SRC c :tangle 1-2-quick-union.c
  #include <stdio.h>
  #define N 10000

  main()
  {
      int i, p, q, t, id[N];
      for (i = 0; i < N; i++)
          id[i] = i;
      while (scanf("%d %d\n", &p, &q) == 2) {
          for (i = p; i != id[i]; i = id[i]);
          for (j = q; j != id[j]; j = id[j]);
          if (i == j)
              continue;
          id[i] = j;
          printf(" %d %d\n", p, q);
      }
  }
#+END_SRC

** Program 1.3 Weighted version of quick union

#+BEGIN_SRC c :tangle 1-3-weighted-quick-union.c
  #include <stdio.h>
  #define N 10000
  main()
    { int i, j, p, q, id[N], sz[N];
      for (i = 0; i < N; i++) 
        { id[i] = i; sz[i] = 1; }
      while (scanf("%d %d\n", &p, &q) == 2)
        { 
          for (i = p; i != id[i]; i = id[i]) ;
          for (j = q; j != id[j]; j = id[j]) ;
          if (i == j) continue;
          if (sz[i] < sz[j])
               { id[i] = j; sz[j] += sz[i]; }
          else { id[j] = i; sz[i] += sz[j]; }
          printf(" %d %d\n", p, q);
        }
   }
#+END_SRC

