programming/c/code/algorithms.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Algorithms in C</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Algorithms in C</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge80864d">Chapter 1. Introduction</a>
<ul>
<li><a href="#org36fab22">Program 1.1 Quick-find solution to connectivity problem</a></li>
<li><a href="#org75c4178">Program 1.2 Quick-union solution to connectivity problem</a></li>
<li><a href="#org16063ea">Program 1.3 Weighted version of quick union</a></li>
<li><a href="#orge2bfa08">Program 1.4 Path compression by halving</a></li>
</ul>
</li>
<li><a href="#orgbd2a4f6">Chapter 2. Principles of Algorithm Analysis</a>
<ul>
<li><a href="#org702fc92">Program 2.1 Sequential search</a></li>
<li><a href="#org1535026">Program 2.2 Binary search</a></li>
</ul>
</li>
<li><a href="#org3af1031">Chapter 3. Elementary Data Structures</a>
<ul>
<li><a href="#org3986be1">3.1 Building Blocks</a>
<ul>
<li><a href="#orgf257647">Program 3.1 Function definition</a></li>
<li><a href="#orgae2eefb">Program 3.2 Types of numbers</a></li>
<li><a href="#orgfdb3504">Program 3.3 Point data type interface</a></li>
<li><a href="#orgfe25884">Program 3.4 Point data type implementation</a></li>
</ul>
</li>
<li><a href="#orgbe7f03a">3.2 Arrays</a>
<ul>
<li><a href="#orga0f2d6e">Program 3.5 Sieve of Eratosthenes</a></li>
<li><a href="#org250d092">Program 3.6 Dynamic memory allocation for an array</a></li>
<li><a href="#org64e7d62">Program 3.7 Coin-flipping simulation</a></li>
<li><a href="#orgad8f848">Program 3.8 Closest-point computation</a></li>
</ul>
</li>
<li><a href="#org785d11f">3.3 Linked Lists</a>
<ul>
<li><a href="#org5dd2287">Program 3.9 Circular list example (Josephus problem)</a></li>
</ul>
</li>
<li><a href="#org741592d">3.4 Elementary List Processing</a>
<ul>
<li><a href="#org5555e44">Program 3.10 List reversal</a></li>
<li><a href="#orgd731f8d">Program 3.11 List insertion sort</a></li>
<li><a href="#org598a11d">Program 3.12 List-processing interface</a></li>
<li><a href="#orga2266f4">Program 3.13 List allocation for the Josephus problem</a></li>
</ul>
</li>
<li><a href="#org3e7bf2c">3.5 Memory Allocation for Lists</a>
<ul>
<li><a href="#org27a23a2">Program 3.14 Implementation of list-processing interface</a></li>
</ul>
</li>
<li><a href="#org91f67a5">3.6 Strings</a>
<ul>
<li><a href="#org8e9ba50">Program 3.15 String search</a></li>
</ul>
</li>
<li><a href="#orgdb8ff44">3.7 Compound Data Structures</a>
<ul>
<li><a href="#org3a9a6cd">Program 3.16 Two-dimensional array allocation</a></li>
<li><a href="#org096fbc2">Program 3.17 Sorting an array of strings</a></li>
<li><a href="#org006e5fb">Program 3.18 Adjacency-matrix graph representation</a></li>
<li><a href="#orgd6f1033">Program 3.19 Adjacency-lists graph representation</a></li>
<li><a href="#orgcfd8695">Program 3.20 A two-dimensional array of lists</a></li>
</ul>
</li>
<li><a href="#org281f5fc">not in chapter</a></li>
</ul>
</li>
<li><a href="#org73fa7dd">Chapter 4. Abstract Data Types</a>
<ul>
<li><a href="#orgb110ba1">4.1 Abstract Objects and Collections of Objects</a></li>
<li><a href="#org7ba81c2">4.2 Pushdown Stack ADT</a>
<ul>
<li><a href="#org5ba73d7">Program 4.1 Pushdown-stack ADT interface</a></li>
</ul>
</li>
<li><a href="#org2d88305">4.3 Examples of Stack ADT Clients</a>
<ul>
<li><a href="#org1bcb0a0">Program 4.2 Postfix-expression evaluation</a></li>
<li><a href="#orgaee7230">Program 4.3 Infix-to-postfix conversion</a></li>
</ul>
</li>
<li><a href="#org63e764d">4.4 Stack ADT Implementations</a>
<ul>
<li><a href="#org5e6dadf">Program 4.4 Array implementation of a pushdown stack</a></li>
<li><a href="#org0f0c7ea">Program 4.5 Linked-list implementation of a pushdown stack</a></li>
</ul>
</li>
<li><a href="#orgbe14b23">4.5 Creation of a New ADT</a>
<ul>
<li><a href="#org4220bc4">Program 4.6 Equivalence-relations ADT interface</a></li>
<li><a href="#orgdafd765">Program 4.7 Equivalence-relations ADT client</a></li>
<li><a href="#org78561d8">Program 4.8 Equivalence-relations ADT implementation</a></li>
</ul>
</li>
<li><a href="#org61dbe1e">4.6 FIFO Queues and Generalized Queues</a>
<ul>
<li><a href="#org3d1110d">Program 4.9 FIFO queue ADT interface</a></li>
<li><a href="#orgf60fa8f">Program 4.10 FIFO queue linked-list implementation</a></li>
<li><a href="#org170570b">Program 4.11 FIFO queue array implementation</a></li>
</ul>
</li>
<li><a href="#org56dee80">4.7 Duplicate and Index Items</a>
<ul>
<li><a href="#orgb607b68">Program 4.12 Stack with index items and no duplicates</a></li>
</ul>
</li>
<li><a href="#org70d0832">4.8 First-Class ADTs</a>
<ul>
<li><a href="#orgb2e6dfb">Program 4.13 Complex numbers driver (roots of unity)</a></li>
<li><a href="#orgbb5d3fd">Program 4.14 First-class data type for complex numbers</a></li>
<li><a href="#org31f0cb1">Program 4.15 Complex-numbers data-type implementation</a></li>
<li><a href="#org28a1421">Program 4.16 First-class ADT for complex numbers</a></li>
<li><a href="#orgb92aeed">Program 4.17 Complex-numbers ADT implementation</a></li>
<li><a href="#org75138a0">Program 4.18 First-class ADT interface for queues</a></li>
<li><a href="#org34404c0">Program 4.19 Queue client program (queue simulation)</a></li>
<li><a href="#orgf276232">Program 4.20 Linked-list implementation of first-class queue</a></li>
</ul>
</li>
<li><a href="#org94521d6">4.9 Application-Based ADT Example</a>
<ul>
<li><a href="#orga952c0c">Program 4.21 Polynomial client (binomial coefficients)</a></li>
<li><a href="#org97c2982">Program 4.22 First-class ADT interface for polynomials</a></li>
<li><a href="#org2460a1e">Program 4.23 Array implementation of polynomial ADT</a></li>
</ul>
</li>
<li><a href="#orgfd254e9">4.10 Perspective</a></li>
</ul>
</li>
<li><a href="#org8304a38">Chapter 5. Recursion and Trees</a>
<ul>
<li><a href="#org02b8fce">5.1 Recursive Algorithms</a>
<ul>
<li><a href="#org3b8fdce">Program 5.1 Factorial function (recursive implementation)</a></li>
<li><a href="#orge55037f">Program 5.2 A questionable recursive program</a></li>
<li><a href="#orgf009ecf">Program 5.3 Euclid's algorithm</a></li>
<li><a href="#org43b632c">Program 5.4 Recursive program to evaluate prefix expressions</a></li>
<li><a href="#org870ea21">Program 5.5 Examples of recursive functions for linked lists</a></li>
</ul>
</li>
<li><a href="#orgef89d24">5.2 Divide and Conquer</a>
<ul>
<li><a href="#org7f0e86e">Program 5.6 Divide-and-conquer to find the maximum</a></li>
<li><a href="#orgd339c05">Program 5.7 Solution to the towers of Hanoi</a></li>
<li><a href="#orgee63fbb">Program 5.8 Divide and conquer to draw a ruler</a></li>
<li><a href="#orgdb46cee">Program 5.9 Nonrecursive program to draw a ruler</a></li>
</ul>
</li>
<li><a href="#orgc753f39">5.3 Dynamic Programming</a>
<ul>
<li><a href="#org3dcd86d">Program 5.10 Fibonacci numbers (recursive implementation)</a></li>
<li><a href="#orgbb41fb7">Program 5.11 Fibonacci numbers (dynamic programming)</a></li>
<li><a href="#orgc110b57">Program 5.12 Knapsack problem (recursive implementation)</a></li>
<li><a href="#orgaf5f560">Program 5.13 Knapsack problem (dynamic programming)</a></li>
</ul>
</li>
<li><a href="#org938156e">5.4 Trees</a></li>
<li><a href="#org59e12a8">5.5 Mathematical Properties of Binary Trees</a></li>
<li><a href="#orgf5eb6d5">5.6 Tree Traversal</a>
<ul>
<li><a href="#org2802b76">Program 5.14 Recursive tree traversal</a></li>
<li><a href="#org9b51410">Program 5.15 Preorder traversal (nonrecursive)</a></li>
<li><a href="#orgb2917de">Program 5.16 Level-order traversal</a></li>
</ul>
</li>
<li><a href="#org594ee5c">5.7 Recursive Binary-Tree Algorithms</a>
<ul>
<li><a href="#orgcd412d7">Program 5.I7 Computation of tree parameters</a></li>
<li><a href="#orgbfbdffe">Program 5-18 Quick tree-print function</a></li>
<li><a href="#org81a46dd">Program 5.I9 Construction of a tournament</a></li>
<li><a href="#org916df5d">Program 5.20 Construction of a parse tree</a></li>
</ul>
</li>
<li><a href="#org11d87b9">5.8 Graph Traversal</a>
<ul>
<li><a href="#org7072a75">Program 5.21 Depth-first search</a></li>
<li><a href="#org7ea6351">Program 5.22 Breadth-first search</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge80864d" class="outline-2">
<h2 id="orge80864d">Chapter 1. Introduction</h2>
<div class="outline-text-2" id="text-orge80864d">
</div>
<div id="outline-container-org36fab22" class="outline-3">
<h3 id="org36fab22">Program 1.1 Quick-find solution to connectivity problem</h3>
<div class="outline-text-3" id="text-org36fab22">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">N</span> 10000

<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">p</span>, <span style="color: #e69f00; font-weight: bold;">q</span>, <span style="color: #e69f00; font-weight: bold;">t</span>, <span style="color: #e69f00; font-weight: bold;">id</span>[N];
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; N; i++)
        id[i] = i;
    <span style="color: #56b4e9; font-weight: bold;">while</span> (scanf(<span style="color: #848ea9;">"%d %d\n"</span>, &amp;p, &amp;q) == 2) {
        <span style="color: #56b4e9; font-weight: bold;">if</span> (id[p] == id[q])
            <span style="color: #56b4e9; font-weight: bold;">continue</span>;
        <span style="color: #56b4e9; font-weight: bold;">for</span> (t = id[p], i = 0; i &lt; N; i++)
            <span style="color: #56b4e9; font-weight: bold;">if</span> (id[i] == t)
                id[i] = id[q];
        printf(<span style="color: #848ea9;">" %d %d\n"</span>, p, q);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org75c4178" class="outline-3">
<h3 id="org75c4178">Program 1.2 Quick-union solution to connectivity problem</h3>
<div class="outline-text-3" id="text-org75c4178">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">N</span> 10000

<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">p</span>, <span style="color: #e69f00; font-weight: bold;">q</span>, <span style="color: #e69f00; font-weight: bold;">t</span>, <span style="color: #e69f00; font-weight: bold;">id</span>[N];
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; N; i++)
        id[i] = i;
    <span style="color: #56b4e9; font-weight: bold;">while</span> (scanf(<span style="color: #848ea9;">"%d %d\n"</span>, &amp;p, &amp;q) == 2) {
        <span style="color: #56b4e9; font-weight: bold;">for</span> (i = p; i != id[i]; i = id[i]);
        <span style="color: #56b4e9; font-weight: bold;">for</span> (j = q; j != id[j]; j = id[j]);
        <span style="color: #56b4e9; font-weight: bold;">if</span> (i == j)
            <span style="color: #56b4e9; font-weight: bold;">continue</span>;
        id[i] = j;
        printf(<span style="color: #848ea9;">" %d %d\n"</span>, p, q);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org16063ea" class="outline-3">
<h3 id="org16063ea">Program 1.3 Weighted version of quick union</h3>
<div class="outline-text-3" id="text-org16063ea">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">N</span> 10000
<span style="color: #d55e00;">main</span>()
  { <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>, <span style="color: #e69f00; font-weight: bold;">p</span>, <span style="color: #e69f00; font-weight: bold;">q</span>, <span style="color: #e69f00; font-weight: bold;">id</span>[N], <span style="color: #e69f00; font-weight: bold;">sz</span>[N];
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; N; i++) 
      { id[i] = i; sz[i] = 1; }
    <span style="color: #56b4e9; font-weight: bold;">while</span> (scanf(<span style="color: #848ea9;">"%d %d\n"</span>, &amp;p, &amp;q) == 2)
      { 
        <span style="color: #56b4e9; font-weight: bold;">for</span> (i = p; i != id[i]; i = id[i]) ;
        <span style="color: #56b4e9; font-weight: bold;">for</span> (j = q; j != id[j]; j = id[j]) ;
        <span style="color: #56b4e9; font-weight: bold;">if</span> (i == j) <span style="color: #56b4e9; font-weight: bold;">continue</span>;
        <span style="color: #56b4e9; font-weight: bold;">if</span> (sz[i] &lt; sz[j])
             { id[i] = j; sz[j] += sz[i]; }
        <span style="color: #56b4e9; font-weight: bold;">else</span> { id[j] = i; sz[i] += sz[j]; }
        printf(<span style="color: #848ea9;">" %d %d\n"</span>, p, q);
      }
 }
</pre>
</div>
</div>
</div>
