programming/c/code/algorithms.org
** Program 1.4 Path compression by halving

#+BEGIN_SRC c :tangle 1-4-path-compression.c
  for (i = p; i != id[i]; i = id[i]) 
    { int t = i; i = id[id[t]]; id[t] = i; } 
  for (j = q; j != id[j]; j = id[j]) ;
    { int t = j; j = id[id[t]]; id[t] = j; } 
#+END_SRC

* Chapter 2. Principles of Algorithm Analysis

** Program 2.1 Sequential search

#+BEGIN_SRC c
  int search(int a[], int v, int l, int r)
    { int i;
      for (i = l; i <= r; i++)
        if (v == a[i]) return i;
      return -1;
    }
#+END_SRC

** Program 2.2 Binary search

#+BEGIN_SRC c
  int search(int a[], int v, int l, int r)
    { 
      while (r >= l)
        { int m = (l+r)/2;
          if (v == a[m]) return m;
          if (v < a[m]) r = m-1; else l = m+1;
        }
      return -1;
    }
#+END_SRC

* Chapter 3. Elementary Data Structures

** 3.1 Building Blocks

*** Program 3.1 Function definition

#+BEGIN_SRC c :tangle 3-01.c
  #include <stdio.h>

  int lg(int);

  main()
  {
      int i, N;
      for (i = 1, N = 10; i <= 6; i++, N *= 10)
          printf("%7d %2d %9d\n", N, lg(N), N * lg(N));
  }

  int lg(int N)
  {
      int i;
      for (i = 0; N > 0; i++, N /= 2);
      return i;
  }
#+END_SRC

*** Program 3.2 Types of numbers

- missing stdio.h and math.h
- gcc 3-02.c -lm
- ./a.out 2

#+BEGIN_SRC c :tangle 3-02.c
  #include <stdlib.h>
  #include <stdio.h>
  #include <math.h>

  typedef int numType;

  numType randNum()
  {
      return rand();
  }

  main(int argc, char *argv[])
  {
      int i, N = atoi(argv[1]);
      float m1 = 0.0, m2 = 0.0;
      numType x;
      for (i = 0; i < N; i++) {
          x = randNum();
          m1 += ((float) x) / N;
          m2 += ((float) x * x) / N;
      }
      printf("       Average: %f\n", m1);
      printf("Std. deviation: %f\n", sqrt(m2 - m1 * m1));
  }
#+END_SRC

*** Program 3.3 Point data type interface

#+BEGIN_SRC c :tangle Point.h
  typedef struct {
      float x;
      float y;
  } point;
  float distance(point a, point b);
#+END_SRC

*** Program 3.4 Point data type implementation

#+BEGIN_SRC c :tangle distance.c
  #include <math.h>
  #include "Point.h"
  float distance(point a, point b)
  {
      float dx = a.x - b.x, dy = a.y - b.y;
      return sqrt(dx * dx + dy * dy);
  }
#+END_SRC

** 3.2 Arrays

*** Program 3.5 Sieve of Eratosthenes

- missing stdio.h

#+BEGIN_SRC c :tangle 3-05.c
  #include <stdio.h>

  #define N 10000

  main()
  {
      int i, j, a[N];
      for (i = 2; i < N; i++)
          a[i] = 1;
      for (i = 2; i < N; i++)
          if (a[i])
              for (j = i; j < N / i; j++)
                  a[i * j] = 0;
      for (i = 2; i < N; i++)
          if (a[i])
              printf("%4d ", i);
      printf("\n");
  }
#+END_SRC

