programming/c/code/algorithms.html

<div id="outline-container-orge2bfa08" class="outline-3">
<h3 id="orge2bfa08">Program 1.4 Path compression by halving</h3>
<div class="outline-text-3" id="text-orge2bfa08">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #56b4e9; font-weight: bold;">for</span> (i = p; i != id[i]; i = id[i]) 
  { <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">t</span> = i; i = id[id[t]]; id[t] = i; } 
<span style="color: #56b4e9; font-weight: bold;">for</span> (j = q; j != id[j]; j = id[j]) ;
  { <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">t</span> = j; j = id[id[t]]; id[t] = j; } 
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbd2a4f6" class="outline-2">
<h2 id="orgbd2a4f6">Chapter 2. Principles of Algorithm Analysis</h2>
<div class="outline-text-2" id="text-orgbd2a4f6">
</div>
<div id="outline-container-org702fc92" class="outline-3">
<h3 id="org702fc92">Program 2.1 Sequential search</h3>
<div class="outline-text-3" id="text-org702fc92">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">search</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">a</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">v</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">l</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">r</span>)
  { <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = l; i &lt;= r; i++)
      <span style="color: #56b4e9; font-weight: bold;">if</span> (v == a[i]) <span style="color: #56b4e9; font-weight: bold;">return</span> i;
    <span style="color: #56b4e9; font-weight: bold;">return</span> -1;
  }
</pre>
</div>
</div>
</div>

<div id="outline-container-org1535026" class="outline-3">
<h3 id="org1535026">Program 2.2 Binary search</h3>
<div class="outline-text-3" id="text-org1535026">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">search</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">a</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">v</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">l</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">r</span>)
  { 
    <span style="color: #56b4e9; font-weight: bold;">while</span> (r &gt;= l)
      { <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">m</span> = (l+r)/2;
        <span style="color: #56b4e9; font-weight: bold;">if</span> (v == a[m]) <span style="color: #56b4e9; font-weight: bold;">return</span> m;
        <span style="color: #56b4e9; font-weight: bold;">if</span> (v &lt; a[m]) r = m-1; <span style="color: #56b4e9; font-weight: bold;">else</span> l = m+1;
      }
    <span style="color: #56b4e9; font-weight: bold;">return</span> -1;
  }
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3af1031" class="outline-2">
<h2 id="org3af1031">Chapter 3. Elementary Data Structures</h2>
<div class="outline-text-2" id="text-org3af1031">
</div>
<div id="outline-container-org3986be1" class="outline-3">
<h3 id="org3986be1">3.1 Building Blocks</h3>
<div class="outline-text-3" id="text-org3986be1">
</div>
<div id="outline-container-orgf257647" class="outline-4">
<h4 id="orgf257647">Program 3.1 Function definition</h4>
<div class="outline-text-4" id="text-orgf257647">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">lg</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);

<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">N</span>;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 1, N = 10; i &lt;= 6; i++, N *= 10)
        printf(<span style="color: #848ea9;">"%7d %2d %9d\n"</span>, N, lg(N), N * lg(N));
}

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">lg</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">N</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; N &gt; 0; i++, N /= 2);
    <span style="color: #56b4e9; font-weight: bold;">return</span> i;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgae2eefb" class="outline-4">
<h4 id="orgae2eefb">Program 3.2 Types of numbers</h4>
<div class="outline-text-4" id="text-orgae2eefb">
<ul class="org-ul">
<li>missing stdio.h and math.h</li>
<li>gcc 3-02.c -lm</li>
<li>./a.out 2</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;math.h&gt;</span>

<span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #0072b2; font-weight: bold;">numType</span>;

<span style="color: #0072b2; font-weight: bold;">numType</span> <span style="color: #d55e00;">randNum</span>()
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> rand();
}

<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">N</span> = atoi(argv[1]);
    <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">m1</span> = 0.0, <span style="color: #e69f00; font-weight: bold;">m2</span> = 0.0;
    <span style="color: #0072b2; font-weight: bold;">numType</span> <span style="color: #e69f00; font-weight: bold;">x</span>;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; N; i++) {
        x = randNum();
        m1 += ((<span style="color: #0072b2; font-weight: bold;">float</span>) x) / N;
        m2 += ((<span style="color: #0072b2; font-weight: bold;">float</span>) x * x) / N;
    }
    printf(<span style="color: #848ea9;">"       Average: %f\n"</span>, m1);
    printf(<span style="color: #848ea9;">"Std. deviation: %f\n"</span>, sqrt(m2 - m1 * m1));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfdb3504" class="outline-4">
<h4 id="orgfdb3504">Program 3.3 Point data type interface</h4>
<div class="outline-text-4" id="text-orgfdb3504">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #56b4e9; font-weight: bold;">struct</span> {
    <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">x</span>;
    <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">y</span>;
} <span style="color: #0072b2; font-weight: bold;">point</span>;
<span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #d55e00;">distance</span>(<span style="color: #0072b2; font-weight: bold;">point</span> <span style="color: #e69f00; font-weight: bold;">a</span>, <span style="color: #0072b2; font-weight: bold;">point</span> <span style="color: #e69f00; font-weight: bold;">b</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfe25884" class="outline-4">
<h4 id="orgfe25884">Program 3.4 Point data type implementation</h4>
<div class="outline-text-4" id="text-orgfe25884">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;math.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"Point.h"</span>
<span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #d55e00;">distance</span>(<span style="color: #0072b2; font-weight: bold;">point</span> <span style="color: #e69f00; font-weight: bold;">a</span>, <span style="color: #0072b2; font-weight: bold;">point</span> <span style="color: #e69f00; font-weight: bold;">b</span>)
{
    <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">dx</span> = a.x - b.x, <span style="color: #e69f00; font-weight: bold;">dy</span> = a.y - b.y;
    <span style="color: #56b4e9; font-weight: bold;">return</span> sqrt(dx * dx + dy * dy);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbe7f03a" class="outline-3">
<h3 id="orgbe7f03a">3.2 Arrays</h3>
<div class="outline-text-3" id="text-orgbe7f03a">
</div>
<div id="outline-container-orga0f2d6e" class="outline-4">
<h4 id="orga0f2d6e">Program 3.5 Sieve of Eratosthenes</h4>
<div class="outline-text-4" id="text-orga0f2d6e">
<ul class="org-ul">
<li>missing stdio.h</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">N</span> 10000

<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>, <span style="color: #e69f00; font-weight: bold;">a</span>[N];
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 2; i &lt; N; i++)
        a[i] = 1;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 2; i &lt; N; i++)
        <span style="color: #56b4e9; font-weight: bold;">if</span> (a[i])
            <span style="color: #56b4e9; font-weight: bold;">for</span> (j = i; j &lt; N / i; j++)
                a[i * j] = 0;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 2; i &lt; N; i++)
        <span style="color: #56b4e9; font-weight: bold;">if</span> (a[i])
            printf(<span style="color: #848ea9;">"%4d "</span>, i);
    printf(<span style="color: #848ea9;">"\n"</span>);
}
</pre>
</div>
</div>
</div>
