programming/c/code/algorithms.org
*** Program 3.6 Dynamic memory allocation for an array

- ./a.out 1000000. took a couple of minutes

#+BEGIN_SRC c :tangle 3-06.c
  #include <stdlib.h>
  #include <stdio.h>

  main(int argc, char *argv[])
  {
      long int i, j, N = atoi(argv[1]);
      int *a = malloc(N * sizeof(int));
      if (a == NULL) {
          printf("Insufficient memory.\n");
          return;
      }
      for (i = 2; i < N; i++)
          a[i] = 1;
      for (i = 2; i < N; i++)
          if (a[i])
              for (j = i; j < N / i; j++)
                  a[i * j] = 0;
      for (i = 2; i < N; i++)
          if (a[i])
              printf("%4d ", i);
      printf("\n");
  }
#+END_SRC

*** Program 3.7 Coin-flipping simulation

- ./a.out 32 1000
- note. it will seg fault with no command line arguments
  - should have a check
- it always returns the same values with the same arguments.
- N first argument. no of coin tosses
- M second argument. no of experiments/ trials

#+BEGIN_SRC c :tangle 3-07.c
  #include <stdlib.h>
  #include <stdio.h>

  int heads()
  {
      return rand() < RAND_MAX / 2;
  }

  main(int argc, char *argv[])
  {
      int i, j, cnt;
      int N = atoi(argv[1]), M = atoi(argv[2]);
      int *f = malloc((N + 1) * sizeof(int));
      for (j = 0; j <= N; j++)
          f[j] = 0;
      for (i = 0; i < M; i++, f[cnt]++)
          for (cnt = 0, j = 0; j <= N; j++)
              if (heads())
                  cnt++;
      for (j = 0; j <= N; j++) {
          printf("%2d ", j);
          for (i = 0; i < f[j]; i += 10)
              printf("*");
          printf("\n");
      }
  }
#+END_SRC

*** Program 3.8 Closest-point computation

N 1st. number of pairs 
d 2nd. length less than

 gcc 3-08.c distance.c -lm
./a.out 4 2

4 pairs of points (8 points) 
distance less than 2
note: random number generator isn't random

printf("%f %f\n",a[i].x,a[i].y); to see same results from rng

#+BEGIN_SRC c :tangle 3-08.c
  #include <math.h>
  #include <stdio.h>
  #include <stdlib.h>
  #include "Point.h"

  float randFloat()
  {
      return 1.0 * rand() / RAND_MAX;
  }

  main(int argc, char *argv[])
  {
      float d = atof(argv[2]);
      int i, j, cnt = 0, N = atoi(argv[1]);
      point *a = malloc(N * (sizeof(*a)));
      for (i = 0; i < N; i++) {
          a[i].x = randFloat();
          a[i].y = randFloat();
      }
      for (i = 0; i < N; i++)
          for (j = i + 1; j < N; j++)
              if (distance(a[i], a[j]) < d)
                  cnt++;
      printf("%d edges shorter than %f\n", cnt, d);
  }
#+END_SRC

** 3.3 Linked Lists

*** Program 3.9 Circular list example (Josephus problem)

- N people
- eliminate every Mth person
- gcc 3-09.c 
- ./a.out 9 5 
- ex. N = 9 and}vI 5

- segmentation fault with no inputs

look at printing all the nodes in the list

#+BEGIN_SRC c :tangle 3-09.c
  #include <stdlib.h>
  #include <stdio.h>

  typedef struct node *link;
  struct node {
      int item;
      link next;
  };

  main(int argc, char *argv[])
  {
      int i, N = atoi(argv[1]), M = atoi(argv[2]);
      link t = malloc(sizeof *t), x = t;
      t->item = 1;
      t->next = t;
      for (i = 2; i <= N; i++) {
          x = (x->next = malloc(sizeof *x));
          x->item = i;
          x->next = t;
      }
      while (x != x->next) {
          for (i = 1; i < M; i++)
              x = x->next;
          x->next = x->next->next;
          N--;
      }
      printf("%d\n", x->item);
  }
#+END_SRC

** 3.4 Elementary List Processing

*** Program 3.10 List reversal

#+BEGIN_SRC c reverse
  link reverse(link x)
  {
      link t, y = x, r = NULL;
      while (y != NULL) {
          t = y->next;
          y->next = r;
          r = y;
          y = t;
      }
      return r;
  }
#+END_SRC

