programming/c/code/algorithms.html

<div id="outline-container-org250d092" class="outline-4">
<h4 id="org250d092">Program 3.6 Dynamic memory allocation for an array</h4>
<div class="outline-text-4" id="text-org250d092">
<ul class="org-ul">
<li>./a.out 1000000. took a couple of minutes</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>, <span style="color: #e69f00; font-weight: bold;">N</span> = atoi(argv[1]);
    <span style="color: #0072b2; font-weight: bold;">int</span> *<span style="color: #e69f00; font-weight: bold;">a</span> = malloc(<span style="color: #0072b2; font-weight: bold;">N</span> * <span style="color: #56b4e9; font-weight: bold;">sizeof</span>(<span style="color: #0072b2; font-weight: bold;">int</span>));
    <span style="color: #56b4e9; font-weight: bold;">if</span> (a == <span style="color: #d55e00; font-weight: bold;">NULL</span>) {
        printf(<span style="color: #848ea9;">"Insufficient memory.\n"</span>);
        <span style="color: #56b4e9; font-weight: bold;">return</span>;
    }
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 2; i &lt; N; i++)
        a[i] = 1;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 2; i &lt; N; i++)
        <span style="color: #56b4e9; font-weight: bold;">if</span> (a[i])
            <span style="color: #56b4e9; font-weight: bold;">for</span> (j = i; j &lt; N / i; j++)
                a[i * j] = 0;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 2; i &lt; N; i++)
        <span style="color: #56b4e9; font-weight: bold;">if</span> (a[i])
            printf(<span style="color: #848ea9;">"%4d "</span>, i);
    printf(<span style="color: #848ea9;">"\n"</span>);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org64e7d62" class="outline-4">
<h4 id="org64e7d62">Program 3.7 Coin-flipping simulation</h4>
<div class="outline-text-4" id="text-org64e7d62">
<ul class="org-ul">
<li>./a.out 32 1000</li>
<li>note. it will seg fault with no command line arguments
<ul class="org-ul">
<li>should have a check</li>
</ul></li>
<li>it always returns the same values with the same arguments.</li>
<li>N first argument. no of coin tosses</li>
<li>M second argument. no of experiments/ trials</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">heads</span>()
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> rand() &lt; RAND_MAX / 2;
}

<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>, <span style="color: #e69f00; font-weight: bold;">cnt</span>;
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">N</span> = atoi(argv[1]), <span style="color: #e69f00; font-weight: bold;">M</span> = atoi(argv[2]);
    <span style="color: #0072b2; font-weight: bold;">int</span> *<span style="color: #e69f00; font-weight: bold;">f</span> = malloc((N + 1) * <span style="color: #56b4e9; font-weight: bold;">sizeof</span>(<span style="color: #0072b2; font-weight: bold;">int</span>));
    <span style="color: #56b4e9; font-weight: bold;">for</span> (j = 0; j &lt;= N; j++)
        f[j] = 0;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; M; i++, f[cnt]++)
        <span style="color: #56b4e9; font-weight: bold;">for</span> (cnt = 0, j = 0; j &lt;= N; j++)
            <span style="color: #56b4e9; font-weight: bold;">if</span> (heads())
                cnt++;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (j = 0; j &lt;= N; j++) {
        printf(<span style="color: #848ea9;">"%2d "</span>, j);
        <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; f[j]; i += 10)
            printf(<span style="color: #848ea9;">"*"</span>);
        printf(<span style="color: #848ea9;">"\n"</span>);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad8f848" class="outline-4">
<h4 id="orgad8f848">Program 3.8 Closest-point computation</h4>
<div class="outline-text-4" id="text-orgad8f848">
<p>
N 1st. number of pairs 
d 2nd. length less than
</p>

<p>
 gcc 3-08.c distance.c -lm
./a.out 4 2
</p>

<p>
4 pairs of points (8 points) 
distance less than 2
note: random number generator isn't random
</p>

<p>
printf("%f %f\n",a[i].x,a[i].y); to see same results from rng
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;math.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"Point.h"</span>

<span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #d55e00;">randFloat</span>()
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> 1.0 * rand() / RAND_MAX;
}

<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">d</span> = atof(argv[2]);
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>, <span style="color: #e69f00; font-weight: bold;">cnt</span> = 0, <span style="color: #e69f00; font-weight: bold;">N</span> = atoi(argv[1]);
    <span style="color: #0072b2; font-weight: bold;">point</span> *<span style="color: #e69f00; font-weight: bold;">a</span> = malloc(N * (<span style="color: #56b4e9; font-weight: bold;">sizeof</span>(*a)));
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; N; i++) {
        a[i].x = randFloat();
        a[i].y = randFloat();
    }
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; N; i++)
        <span style="color: #56b4e9; font-weight: bold;">for</span> (j = i + 1; j &lt; N; j++)
            <span style="color: #56b4e9; font-weight: bold;">if</span> (distance(a[i], a[j]) &lt; d)
                cnt++;
    printf(<span style="color: #848ea9;">"%d edges shorter than %f\n"</span>, cnt, d);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org785d11f" class="outline-3">
<h3 id="org785d11f">3.3 Linked Lists</h3>
<div class="outline-text-3" id="text-org785d11f">
</div>
<div id="outline-container-org5dd2287" class="outline-4">
<h4 id="org5dd2287">Program 3.9 Circular list example (Josephus problem)</h4>
<div class="outline-text-4" id="text-org5dd2287">
<ul class="org-ul">
<li>N people</li>
<li>eliminate every Mth person</li>
<li>gcc 3-09.c</li>
<li>./a.out 9 5</li>
<li>ex. N = 9 and}vI 5</li>

<li>segmentation fault with no inputs</li>
</ul>

<p>
look at printing all the nodes in the list
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">node</span> *<span style="color: #0072b2; font-weight: bold;">link</span>;
<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">node</span> {
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">item</span>;
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">next</span>;
};

<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">N</span> = atoi(argv[1]), <span style="color: #e69f00; font-weight: bold;">M</span> = atoi(argv[2]);
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">t</span> = malloc(<span style="color: #56b4e9; font-weight: bold;">sizeof</span> *t), <span style="color: #e69f00; font-weight: bold;">x</span> = t;
    t-&gt;item = 1;
    t-&gt;next = t;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 2; i &lt;= N; i++) {
        x = (x-&gt;next = malloc(<span style="color: #56b4e9; font-weight: bold;">sizeof</span> *x));
        x-&gt;item = i;
        x-&gt;next = t;
    }
    <span style="color: #56b4e9; font-weight: bold;">while</span> (x != x-&gt;next) {
        <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 1; i &lt; M; i++)
            x = x-&gt;next;
        x-&gt;next = x-&gt;next-&gt;next;
        N--;
    }
    printf(<span style="color: #848ea9;">"%d\n"</span>, x-&gt;item);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org741592d" class="outline-3">
<h3 id="org741592d">3.4 Elementary List Processing</h3>
<div class="outline-text-3" id="text-org741592d">
</div>
<div id="outline-container-org5555e44" class="outline-4">
<h4 id="org5555e44">Program 3.10 List reversal</h4>
<div class="outline-text-4" id="text-org5555e44">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #d55e00;">reverse</span>(<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">x</span>)
{
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">t</span>, <span style="color: #e69f00; font-weight: bold;">y</span> = x, <span style="color: #e69f00; font-weight: bold;">r</span> = <span style="color: #d55e00; font-weight: bold;">NULL</span>;
    <span style="color: #56b4e9; font-weight: bold;">while</span> (y != <span style="color: #d55e00; font-weight: bold;">NULL</span>) {
        t = y-&gt;next;
        y-&gt;next = r;
        r = y;
        y = t;
    }
    <span style="color: #56b4e9; font-weight: bold;">return</span> r;
}
</pre>
</div>
</div>
</div>
