programming/c/code/algorithms.org
*** Program 3.11 List insertion sort

see cc3-11.c which includes a main

#+BEGIN_SRC c :tangle 3-11.c
  struct node heada, headb;
  link t, u, x, a = &heada, b;
  for (i = 0, t = a; i < N; i++) {
      t->next = malloc(sizeof *t);
      t = t->next;
      t->next = NULL;
      t->item = rand() % 1000;
  }

  b = &headb;
  b->next = NULL;
  for (t = a->next; t != NULL; t = u) {
      u = t->next;
      for (x = b; x->next != NULL; x = x->next)
          if (x->next->item > t->item)
              break;
      t->next = x->next;
      x->next = t;
  }
#+END_SRC

*** Program 3.12 List-processing interface

#+BEGIN_SRC c :tangle list.h
  typedef struct node *link;
  struct node {
      itemType item;
      link next;
  };
  typedef link Node;
  void initNodes(int);
  link newNode(int);
  void freeNode(link);
  void insertNext(link, link);
  link deleteNext(link);
  link Next(link);
  int Item(link);
#+END_SRC

*** Program 3.13 List allocation for the Josephus problem

- gcc 3-13.c 3-14.c
- ./a.out 9 5
- not change itemtype to int in list.h

#+BEGIN_SRC c :tangle 3-13.c
  #include "list.h"
  #include <stdio.h>

  main(int argc, char *argv[])
  {
      int i, N = atoi(argv[1]), M = atoi(argv[2]);
      Node t, x;
      initNodes(N);
      for (i = 2, x = newNode(1); i <= N; i++) {
          t = newNode(i);
          insertNext(x, t);
          x = t;
      }
      while (x != Next(x)) {
          for (i = 1; i < M; i++)
              x = Next(x);
          freeNode(deleteNext(x));
      }
      printf("%d\n", Item(x));
  }
#+END_SRC

** 3.5 Memory Allocation for Lists

*** Program 3.14 Implementation of list-processing interface

#+BEGIN_SRC c :tangle 3-14.c
  #include <stdlib.h>
  #include "list.h"

  link freelist;

  void initNodes(int N)
  {
      int i;
      freelist = malloc((N + 1) * (sizeof *freelist));
      for (i = 0; i < N + 1; i++)
          freelist[i].next = &freelist[i + 1];
      freelist[N].next = NULL;
  }

  link newNode(int i)
  {
      link x = deleteNext(freelist);
      x->item = i;
      x->next = x;
      return x;
  }

  void freeNode(link x)
  {
      insertNext(freelist, x);
  }

  void insertNext(link x, link t)
  {
      t->next = x->next;
      x->next = t;
  }

  link deleteNext(link x)
  {
      link t = x->next;
      x->next = t->next;
      return t;
  }

  link Next(link x)
  {
      return x->next;
  }

  int Item(link x)
  {
      return x->item;
  }
#+END_SRC

** 3.6 Strings

*** Program 3.15 String search

- gcc -g 3-15.c

- ./a.out shine
- enter sunshine EOF
- the program returns 3 (position of the word in the sentence)

#+BEGIN_EXAMPLE
  ./a.out shine
  sunshine
  3 

  ./a.out fox
  the quick brown fox
  16 
#+END_EXAMPLE

#+BEGIN_SRC c :tangle 3-15.c
  #include <stdio.h>
  #define N 10000

  main(int argc, char *argv[])
  {
      int i, j, t;
      char a[N], *p = argv[1];
      for (i = 0; i < N - 1; a[i] = t, i++)
          if ((t = getchar()) == EOF)
              break;
      a[i] = 0;
      for (i = 0; a[i] != 0; i++) {
          for (j = 0; p[j] != 0; j++)
              if (a[i + j] != p[j])
                  break;
          if (p[j] == 0)
              printf("%d ", i);
      }
      printf("\n");
  }
#+END_SRC

** 3.7 Compound Data Structures

