programming/c/code/algorithms.html

<div id="outline-container-orgd731f8d" class="outline-4">
<h4 id="orgd731f8d">Program 3.11 List insertion sort</h4>
<div class="outline-text-4" id="text-orgd731f8d">
<p>
see cc3-11.c which includes a main
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">node</span> <span style="color: #e69f00; font-weight: bold;">heada</span>, <span style="color: #e69f00; font-weight: bold;">headb</span>;
<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">t</span>, <span style="color: #e69f00; font-weight: bold;">u</span>, <span style="color: #e69f00; font-weight: bold;">x</span>, <span style="color: #e69f00; font-weight: bold;">a</span> = &amp;heada, <span style="color: #e69f00; font-weight: bold;">b</span>;
<span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0, t = a; i &lt; N; i++) {
    t-&gt;next = malloc(<span style="color: #56b4e9; font-weight: bold;">sizeof</span> *t);
    t = t-&gt;next;
    t-&gt;next = <span style="color: #d55e00; font-weight: bold;">NULL</span>;
    t-&gt;item = rand() % 1000;
}

b = &amp;headb;
b-&gt;next = <span style="color: #d55e00; font-weight: bold;">NULL</span>;
<span style="color: #56b4e9; font-weight: bold;">for</span> (t = a-&gt;next; t != <span style="color: #d55e00; font-weight: bold;">NULL</span>; t = u) {
    u = t-&gt;next;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (x = b; x-&gt;next != <span style="color: #d55e00; font-weight: bold;">NULL</span>; x = x-&gt;next)
        <span style="color: #56b4e9; font-weight: bold;">if</span> (x-&gt;next-&gt;item &gt; t-&gt;item)
            <span style="color: #56b4e9; font-weight: bold;">break</span>;
    t-&gt;next = x-&gt;next;
    x-&gt;next = t;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org598a11d" class="outline-4">
<h4 id="org598a11d">Program 3.12 List-processing interface</h4>
<div class="outline-text-4" id="text-org598a11d">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">node</span> *<span style="color: #0072b2; font-weight: bold;">link</span>;
<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">node</span> {
    <span style="color: #0072b2; font-weight: bold;">itemType</span> <span style="color: #e69f00; font-weight: bold;">item</span>;
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">next</span>;
};
<span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #0072b2; font-weight: bold;">Node</span>;
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">initNodes</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #d55e00;">newNode</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">freeNode</span>(<span style="color: #0072b2; font-weight: bold;">link</span>);
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">insertNext</span>(<span style="color: #0072b2; font-weight: bold;">link</span>, <span style="color: #0072b2; font-weight: bold;">link</span>);
<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #d55e00;">deleteNext</span>(<span style="color: #0072b2; font-weight: bold;">link</span>);
<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #d55e00;">Next</span>(<span style="color: #0072b2; font-weight: bold;">link</span>);
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">Item</span>(<span style="color: #0072b2; font-weight: bold;">link</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-orga2266f4" class="outline-4">
<h4 id="orga2266f4">Program 3.13 List allocation for the Josephus problem</h4>
<div class="outline-text-4" id="text-orga2266f4">
<ul class="org-ul">
<li>gcc 3-13.c 3-14.c</li>
<li>./a.out 9 5</li>
<li>not change itemtype to int in list.h</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"list.h"</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">N</span> = atoi(argv[1]), <span style="color: #e69f00; font-weight: bold;">M</span> = atoi(argv[2]);
    <span style="color: #0072b2; font-weight: bold;">Node</span> <span style="color: #e69f00; font-weight: bold;">t</span>, <span style="color: #e69f00; font-weight: bold;">x</span>;
    initNodes(N);
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 2, x = newNode(1); i &lt;= N; i++) {
        t = newNode(i);
        insertNext(x, t);
        x = t;
    }
    <span style="color: #56b4e9; font-weight: bold;">while</span> (x != Next(x)) {
        <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 1; i &lt; M; i++)
            x = Next(x);
        freeNode(deleteNext(x));
    }
    printf(<span style="color: #848ea9;">"%d\n"</span>, Item(x));
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3e7bf2c" class="outline-3">
<h3 id="org3e7bf2c">3.5 Memory Allocation for Lists</h3>
<div class="outline-text-3" id="text-org3e7bf2c">
</div>
<div id="outline-container-org27a23a2" class="outline-4">
<h4 id="org27a23a2">Program 3.14 Implementation of list-processing interface</h4>
<div class="outline-text-4" id="text-org27a23a2">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"list.h"</span>

<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">freelist</span>;

<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">initNodes</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">N</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;
    freelist = malloc((N + 1) * (<span style="color: #56b4e9; font-weight: bold;">sizeof</span> *freelist));
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; N + 1; i++)
        freelist[i].next = &amp;freelist[i + 1];
    freelist[N].next = <span style="color: #d55e00; font-weight: bold;">NULL</span>;
}

<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #d55e00;">newNode</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>)
{
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">x</span> = deleteNext(freelist);
    x-&gt;item = i;
    x-&gt;next = x;
    <span style="color: #56b4e9; font-weight: bold;">return</span> x;
}

<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">freeNode</span>(<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">x</span>)
{
    insertNext(freelist, x);
}

<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">insertNext</span>(<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">x</span>, <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">t</span>)
{
    t-&gt;next = x-&gt;next;
    x-&gt;next = t;
}

<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #d55e00;">deleteNext</span>(<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">x</span>)
{
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">t</span> = x-&gt;next;
    x-&gt;next = t-&gt;next;
    <span style="color: #56b4e9; font-weight: bold;">return</span> t;
}

<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #d55e00;">Next</span>(<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">x</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> x-&gt;next;
}

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">Item</span>(<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">x</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> x-&gt;item;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org91f67a5" class="outline-3">
<h3 id="org91f67a5">3.6 Strings</h3>
<div class="outline-text-3" id="text-org91f67a5">
</div>
<div id="outline-container-org8e9ba50" class="outline-4">
<h4 id="org8e9ba50">Program 3.15 String search</h4>
<div class="outline-text-4" id="text-org8e9ba50">
<ul class="org-ul">
<li>gcc -g 3-15.c</li>

<li>./a.out shine</li>
<li>enter sunshine EOF</li>
<li>the program returns 3 (position of the word in the sentence)</li>
</ul>

<pre class="example">
./a.out shine
sunshine
3 

./a.out fox
the quick brown fox
16 
</pre>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">N</span> 10000

<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>, <span style="color: #e69f00; font-weight: bold;">t</span>;
    <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">a</span>[N], *<span style="color: #e69f00; font-weight: bold;">p</span> = argv[1];
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; N - 1; a[i] = t, i++)
        <span style="color: #56b4e9; font-weight: bold;">if</span> ((t = getchar()) == EOF)
            <span style="color: #56b4e9; font-weight: bold;">break</span>;
    a[i] = 0;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; a[i] != 0; i++) {
        <span style="color: #56b4e9; font-weight: bold;">for</span> (j = 0; p[j] != 0; j++)
            <span style="color: #56b4e9; font-weight: bold;">if</span> (a[i + j] != p[j])
                <span style="color: #56b4e9; font-weight: bold;">break</span>;
        <span style="color: #56b4e9; font-weight: bold;">if</span> (p[j] == 0)
            printf(<span style="color: #848ea9;">"%d "</span>, i);
    }
    printf(<span style="color: #848ea9;">"\n"</span>);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdb8ff44" class="outline-3">
<h3 id="orgdb8ff44">3.7 Compound Data Structures</h3>
<div class="outline-text-3" id="text-orgdb8ff44">
</div>
