programming/c/code/algorithms.org
*** Program 3.16 Two-dimensional array allocation

#+BEGIN_SRC c
  int **malloc2d(int r, int c)
  {
      int i;
      int **t = malloc(r * sizeof(int *));
      for (i = 0; i < r; i++)
          t[i] = malloc(c * sizeof(int));
      return t;
  }
#+END_SRC

*** Program 3.17 Sorting an array of strings

- compilation warnings with qsort

#+BEGIN_EXAMPLE
./a.out 
the
quick
brown
fox
<EOF> C-d emacs shell
brown
fox
quick
the
#+END_EXAMPLE

#+BEGIN_SRC c :tangle 3-17.c
  #include <stdio.h>
  #include <stdlib.h>
  #include <string.h>

  #define Nmax 1000
  #define Mmax 10000

  char buf[Mmax];
  int M = 0;

  int compare(void *i, void *j)
  {
      return strcmp(*(char **) i, *(char **) j);
  }

  main()
  {
      int i, N;
      char *a[Nmax];
      for (N = 0; N < Nmax; N++) {
          a[N] = &buf[M];
          if (scanf("%s", a[N]) == EOF)
              break;
          M += strlen(a[N]) + 1;
      }
      qsort(a, N, sizeof(char *), compare);
      for (i = 0; i < N; i++)
          printf("%s\n", a[i]);
  }
#+END_SRC

*** Program 3.18 Adjacency-matrix graph representation

need to define V

#+BEGIN_SRC c :tangle 3-18.c
  #include <stdio.h>
  #include <stdlib.h>

  main()
  {
      int i, j, adj[V][V];
      for (i = 0; i < V; i++)
          for (j = 0; j < V; j++)
              adj[i][j] = 0;
      for (i = 0; i < V; i++)
          adj[i][i] = 1;
      while (scanf("%d %d\n", &i, &j) == 2) {
          adj[i][j] = 1;
          adj[j][i] = 1;
      }
  }
#+END_SRC

*** Program 3.19 Adjacency-lists graph representation

- need to define V

#+BEGIN_SRC c :tangle 3-19.c
  #include <stdio.h>
  #include <stdlib.h>

  typedef struct node *link;
  struct node {
      int v;
      link next;
  };
  link NEW(int v, link next)
  {
      link x = malloc(sizeof *x);
      x->v = v;
      x->next = next;
      return x;
  }

  main()
  {
      int i, j;
      link adj[V];
      for (i = 0; i < V; i++)
          adj[i] = NULL;
      while (scanf("%d %d\n", &i, &j) == 2) {
          adj[j] = NEW(i, adj[j]);
          adj[i] = NEW(j, adj[i]);
      }
  }

#+END_SRC

*** Program 3.20 A two-dimensional array of lists

#+BEGIN_SRC c
  #include <math.h>
  #include <stdio.h>
  #include <stdlib.h>
  #include "Point.h"

  typedef struct node *link;

  struct node {
      point p;
      link next;
  };
  link **grid;
  int G;
  float d;
  int cnt = 0;

  gridinsert(float x, float y)
  {
      int i, j;
      link s;
      int X = x * G + 1;
      int Y = y * G + 1;
      link t = malloc(sizeof *t);
      t->p.x = x;
      t->p.y = y;
      for (i = X - 1; i <= X + 1; i++)
          for (j = Y - 1; j <= Y + 1; j++)
              for (s = grid[i][j]; s != NULL; s = s->next)
                  if (distance(s->p, t->p) < d)
                      cnt++;
      t->next = grid[X][Y];
      grid[X][Y] = t;
  }

  main(int argc, char *argv[])
  {
      int i, j, N = atoi(argv[1]);
      d = atof(argv[2]);
      G = 1 / d;
      grid = malloc2d(G + 2, G + 2);
      for (i = 0; i < G + 2; i++)
          for (j = 0; j < G + 2; j++)
              grid[i][j] = NULL;
      for (i = 0; i < N; i++)
          gridinsert(randFloat(), randFloat());
      printf("%d edges shorter than %f\n", cnt, d);
  }
#+END_SRC

