programming/c/code/algorithms.html
<div id="outline-container-org3a9a6cd" class="outline-4">
<h4 id="org3a9a6cd">Program 3.16 Two-dimensional array allocation</h4>
<div class="outline-text-4" id="text-org3a9a6cd">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">int</span> **<span style="color: #d55e00;">malloc2d</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">r</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;
    <span style="color: #0072b2; font-weight: bold;">int</span> **<span style="color: #e69f00; font-weight: bold;">t</span> = malloc(<span style="color: #0072b2; font-weight: bold;">r</span> * <span style="color: #56b4e9; font-weight: bold;">sizeof</span>(<span style="color: #0072b2; font-weight: bold;">int</span> *));
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; r; i++)
        t[i] = malloc(<span style="color: #0072b2; font-weight: bold;">c</span> * <span style="color: #56b4e9; font-weight: bold;">sizeof</span>(<span style="color: #0072b2; font-weight: bold;">int</span>));
    <span style="color: #56b4e9; font-weight: bold;">return</span> t;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org096fbc2" class="outline-4">
<h4 id="org096fbc2">Program 3.17 Sorting an array of strings</h4>
<div class="outline-text-4" id="text-org096fbc2">
<ul class="org-ul">
<li>compilation warnings with qsort</li>
</ul>

<pre class="example">
./a.out 
the
quick
brown
fox
&lt;EOF&gt; C-d emacs shell
brown
fox
quick
the
</pre>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;string.h&gt;</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">Nmax</span> 1000
<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">Mmax</span> 10000

<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">buf</span>[Mmax];
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">M</span> = 0;

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">compare</span>(<span style="color: #0072b2; font-weight: bold;">void</span> *<span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #0072b2; font-weight: bold;">void</span> *<span style="color: #e69f00; font-weight: bold;">j</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> strcmp(*(<span style="color: #0072b2; font-weight: bold;">char</span> **) i, *(<span style="color: #0072b2; font-weight: bold;">char</span> **) j);
}

<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">N</span>;
    <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">a</span>[Nmax];
    <span style="color: #56b4e9; font-weight: bold;">for</span> (N = 0; N &lt; Nmax; N++) {
        a[N] = &amp;buf[M];
        <span style="color: #56b4e9; font-weight: bold;">if</span> (scanf(<span style="color: #848ea9;">"%s"</span>, a[N]) == EOF)
            <span style="color: #56b4e9; font-weight: bold;">break</span>;
        M += strlen(a[N]) + 1;
    }
    qsort(a, N, <span style="color: #56b4e9; font-weight: bold;">sizeof</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *), compare);
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; N; i++)
        printf(<span style="color: #848ea9;">"%s\n"</span>, a[i]);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org006e5fb" class="outline-4">
<h4 id="org006e5fb">Program 3.18 Adjacency-matrix graph representation</h4>
<div class="outline-text-4" id="text-org006e5fb">
<p>
need to define V
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>

<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>, <span style="color: #e69f00; font-weight: bold;">adj</span>[V][V];
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; V; i++)
        <span style="color: #56b4e9; font-weight: bold;">for</span> (j = 0; j &lt; V; j++)
            adj[i][j] = 0;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; V; i++)
        adj[i][i] = 1;
    <span style="color: #56b4e9; font-weight: bold;">while</span> (scanf(<span style="color: #848ea9;">"%d %d\n"</span>, &amp;i, &amp;j) == 2) {
        adj[i][j] = 1;
        adj[j][i] = 1;
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd6f1033" class="outline-4">
<h4 id="orgd6f1033">Program 3.19 Adjacency-lists graph representation</h4>
<div class="outline-text-4" id="text-orgd6f1033">
<ul class="org-ul">
<li>need to define V</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>

<span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">node</span> *<span style="color: #0072b2; font-weight: bold;">link</span>;
<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">node</span> {
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">v</span>;
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">next</span>;
};
<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #d55e00;">NEW</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">v</span>, <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">next</span>)
{
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">x</span> = malloc(<span style="color: #56b4e9; font-weight: bold;">sizeof</span> *x);
    x-&gt;v = v;
    x-&gt;next = next;
    <span style="color: #56b4e9; font-weight: bold;">return</span> x;
}

<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>;
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">adj</span>[V];
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; V; i++)
        adj[i] = <span style="color: #d55e00; font-weight: bold;">NULL</span>;
    <span style="color: #56b4e9; font-weight: bold;">while</span> (scanf(<span style="color: #848ea9;">"%d %d\n"</span>, &amp;i, &amp;j) == 2) {
        adj[j] = NEW(i, adj[j]);
        adj[i] = NEW(j, adj[i]);
    }
}

</pre>
</div>
</div>
</div>

<div id="outline-container-orgcfd8695" class="outline-4">
<h4 id="orgcfd8695">Program 3.20 A two-dimensional array of lists</h4>
<div class="outline-text-4" id="text-orgcfd8695">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;math.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"Point.h"</span>

<span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">node</span> *<span style="color: #0072b2; font-weight: bold;">link</span>;

<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">node</span> {
    <span style="color: #0072b2; font-weight: bold;">point</span> <span style="color: #e69f00; font-weight: bold;">p</span>;
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">next</span>;
};
<span style="color: #0072b2; font-weight: bold;">link</span> **<span style="color: #e69f00; font-weight: bold;">grid</span>;
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">G</span>;
<span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">d</span>;
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">cnt</span> = 0;

<span style="color: #d55e00;">gridinsert</span>(<span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">x</span>, <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">y</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>;
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">s</span>;
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">X</span> = x * G + 1;
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">Y</span> = y * G + 1;
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">t</span> = malloc(<span style="color: #56b4e9; font-weight: bold;">sizeof</span> *t);
    t-&gt;p.x = x;
    t-&gt;p.y = y;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = X - 1; i &lt;= X + 1; i++)
        <span style="color: #56b4e9; font-weight: bold;">for</span> (j = Y - 1; j &lt;= Y + 1; j++)
            <span style="color: #56b4e9; font-weight: bold;">for</span> (s = grid[i][j]; s != <span style="color: #d55e00; font-weight: bold;">NULL</span>; s = s-&gt;next)
                <span style="color: #56b4e9; font-weight: bold;">if</span> (distance(s-&gt;p, t-&gt;p) &lt; d)
                    cnt++;
    t-&gt;next = grid[X][Y];
    grid[X][Y] = t;
}

<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>, <span style="color: #e69f00; font-weight: bold;">N</span> = atoi(argv[1]);
    d = atof(argv[2]);
    G = 1 / d;
    grid = malloc2d(G + 2, G + 2);
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; G + 2; i++)
        <span style="color: #56b4e9; font-weight: bold;">for</span> (j = 0; j &lt; G + 2; j++)
            grid[i][j] = <span style="color: #d55e00; font-weight: bold;">NULL</span>;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; N; i++)
        gridinsert(randFloat(), randFloat());
    printf(<span style="color: #848ea9;">"%d edges shorter than %f\n"</span>, cnt, d);
}
</pre>
</div>
</div>
</div>
</div>
