programming/c/code/algorithms.org
** not in chapter

#+BEGIN_SRC c
  #include <math.h>
  #include <stdlib.h>

  typedef int numType;
  #define R 1000

  numType randNum()
  {
      return rand() % R;
  }

  main(int argc, char *argv[])
  {
      int i, N = atoi(argv[1]);
      int *f = malloc(R * sizeof(int));
      float m1 = 0.0, m2 = 0.0, t = 0.0;
      numType x;
      for (i = 0; i < R; i++)
          f[i] = 0;
      for (i = 0; i < N; i++) {
          f[x = randNum()]++;
          m1 += (float) x / N;
          m2 += (float) x *x / N;
      }
      for (i = 0; i < R; i++)
          t += f[i] * f[i];
      printf("       Average: %f\n", m1);
      printf("Std. deviation: %f\n", sqrt(m2 - m1 * m1));
      printf("    Chi-square: %f\n", (R * t / N) - N);
  }
#+END_SRC

* Chapter 4. Abstract Data Types

** 4.1 Abstract Objects and Collections of Objects

no code

** 4.2 Pushdown Stack ADT

*** Program 4.1 Pushdown-stack ADT interface

#+BEGIN_SRC c :mkdirp yes :tangle stack/STACK.h
  void STACKinit(int);
  int STACKempty();
  void STACKpush(Item);
  Item STACKpop();
#+END_SRC

** 4.3 Examples of Stack ADT Clients

*** Program 4.2 Postfix-expression evaluation

- gcc 4-02.c 4-04.c
- or
- gcc 4-02.c 4-05.c 
- ./a.out "5 9 8 + 4 6 * * 7 + *"

#+BEGIN_SRC c :mkdirp yes :tangle stack/4-02.c
  /* Program 4.2 Postfix-expression evaluation */

  #include <stdio.h>
  #include <string.h>
  #include "Item.h"
  #include "STACK.h"

  main(int argc, char *argv[])
  {
      char *a = argv[1];
      int i, N = strlen(a);
      STACKinit(N);
      for (i = 0; i < N; i++) {
          if (a[i] == '+')
              STACKpush(STACKpop() + STACKpop());
          if (a[i] == '*')
              STACKpush(STACKpop() * STACKpop());
          if ((a[i] >= '0') && (a[i] <= '9'))
              STACKpush(0);
          while ((a[i] >= '0') && (a[i] <= '9'))
              STACKpush(10 * STACKpop() + (a[i++] - '0'));
      }
      printf("%d \n", STACKpop());
  }
#+END_SRC

*** Program 4.3 Infix-to-postfix conversion

- gcc 4-03.c 4-05.c
- or
- gcc 4-03.c 4-04.c 
- ./a.out "(5 * (((9 + 8) * (4 * 6)) + 7))"
- => 5 9 8 + 4 6 * * 7 + * 

#+BEGIN_SRC c :mkdirp yes :tangle stack/4-03.c
  /* Program 4.3 Infix-to-postfix conversion */

  #include <stdio.h>
  #include <string.h>
  #include "Item.h"
  #include "STACK.h"

  main(int argc, char *argv[])
  {
      char *a = argv[1];
      int i, N = strlen(a);
      STACKinit(N);
      for (i = 0; i < N; i++) {
          if (a[i] == ')')
              printf("%c ", STACKpop());
          if ((a[i] == '+') || (a[i] == '*'))
              STACKpush(a[i]);
          if ((a[i] >= '0') && (a[i] <= '9'))
              printf("%c ", a[i]);
      }
      printf("\n");
  }
#+END_SRC

** 4.4 Stack ADT Implementations

*** Program 4.4 Array implementation of a pushdown stack

#+BEGIN_SRC c :mkdirp yes :tangle stack/4-04.c
  /* Array implementation of a pushdown stack */

  #include <stdlib.h>
  #include "Item.h"
  #include "STACK.h"

  static Item *s;
  static int N;

  void STACKinit(int maxN)
  {
      s = malloc(maxN * sizeof(Item));
      N = 0;
  }

  int STACKempty()
  {
      return N == 0;
  }

  void STACKpush(Item item)
  {
      s[N++] = item;
  }

  Item STACKpop()
  {
      return s[--N];
  }
#+END_SRC

