programming/c/code/algorithms.html

<div id="outline-container-org281f5fc" class="outline-3">
<h3 id="org281f5fc">not in chapter</h3>
<div class="outline-text-3" id="text-org281f5fc">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;math.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>

<span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #0072b2; font-weight: bold;">numType</span>;
<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">R</span> 1000

<span style="color: #0072b2; font-weight: bold;">numType</span> <span style="color: #d55e00;">randNum</span>()
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> rand() % R;
}

<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">N</span> = atoi(argv[1]);
    <span style="color: #0072b2; font-weight: bold;">int</span> *<span style="color: #e69f00; font-weight: bold;">f</span> = malloc(<span style="color: #0072b2; font-weight: bold;">R</span> * <span style="color: #56b4e9; font-weight: bold;">sizeof</span>(<span style="color: #0072b2; font-weight: bold;">int</span>));
    <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">m1</span> = 0.0, <span style="color: #e69f00; font-weight: bold;">m2</span> = 0.0, <span style="color: #e69f00; font-weight: bold;">t</span> = 0.0;
    <span style="color: #0072b2; font-weight: bold;">numType</span> <span style="color: #e69f00; font-weight: bold;">x</span>;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; R; i++)
        f[i] = 0;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; N; i++) {
        f[x = randNum()]++;
        m1 += (<span style="color: #0072b2; font-weight: bold;">float</span>) x / N;
        m2 += (<span style="color: #0072b2; font-weight: bold;">float</span>) <span style="color: #0072b2; font-weight: bold;">x</span> *<span style="color: #e69f00; font-weight: bold;">x</span> / N;
    }
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; R; i++)
        t += f[i] * f[i];
    printf(<span style="color: #848ea9;">"       Average: %f\n"</span>, m1);
    printf(<span style="color: #848ea9;">"Std. deviation: %f\n"</span>, sqrt(m2 - m1 * m1));
    printf(<span style="color: #848ea9;">"    Chi-square: %f\n"</span>, (R * t / N) - N);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org73fa7dd" class="outline-2">
<h2 id="org73fa7dd">Chapter 4. Abstract Data Types</h2>
<div class="outline-text-2" id="text-org73fa7dd">
</div>
<div id="outline-container-orgb110ba1" class="outline-3">
<h3 id="orgb110ba1">4.1 Abstract Objects and Collections of Objects</h3>
<div class="outline-text-3" id="text-orgb110ba1">
<p>
no code
</p>
</div>
</div>

<div id="outline-container-org7ba81c2" class="outline-3">
<h3 id="org7ba81c2">4.2 Pushdown Stack ADT</h3>
<div class="outline-text-3" id="text-org7ba81c2">
</div>
<div id="outline-container-org5ba73d7" class="outline-4">
<h4 id="org5ba73d7">Program 4.1 Pushdown-stack ADT interface</h4>
<div class="outline-text-4" id="text-org5ba73d7">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">STACKinit</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">STACKempty</span>();
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">STACKpush</span>(Item);
<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #d55e00;">STACKpop</span>();
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2d88305" class="outline-3">
<h3 id="org2d88305">4.3 Examples of Stack ADT Clients</h3>
<div class="outline-text-3" id="text-org2d88305">
</div>
<div id="outline-container-org1bcb0a0" class="outline-4">
<h4 id="org1bcb0a0">Program 4.2 Postfix-expression evaluation</h4>
<div class="outline-text-4" id="text-org1bcb0a0">
<ul class="org-ul">
<li>gcc 4-02.c 4-04.c</li>
<li>or</li>
<li>gcc 4-02.c 4-05.c</li>
<li>./a.out "5 9 8 + 4 6 * * 7 + *"</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">Program 4.2 Postfix-expression evaluation </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;string.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"Item.h"</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"STACK.h"</span>

<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">a</span> = argv[1];
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">N</span> = strlen(a);
    STACKinit(N);
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; N; i++) {
        <span style="color: #56b4e9; font-weight: bold;">if</span> (a[i] == <span style="color: #848ea9;">'+'</span>)
            STACKpush(STACKpop() + STACKpop());
        <span style="color: #56b4e9; font-weight: bold;">if</span> (a[i] == <span style="color: #848ea9;">'*'</span>)
            STACKpush(STACKpop() * STACKpop());
        <span style="color: #56b4e9; font-weight: bold;">if</span> ((a[i] &gt;= <span style="color: #848ea9;">'0'</span>) &amp;&amp; (a[i] &lt;= <span style="color: #848ea9;">'9'</span>))
            STACKpush(0);
        <span style="color: #56b4e9; font-weight: bold;">while</span> ((a[i] &gt;= <span style="color: #848ea9;">'0'</span>) &amp;&amp; (a[i] &lt;= <span style="color: #848ea9;">'9'</span>))
            STACKpush(10 * STACKpop() + (a[i++] - <span style="color: #848ea9;">'0'</span>));
    }
    printf(<span style="color: #848ea9;">"%d \n"</span>, STACKpop());
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaee7230" class="outline-4">
<h4 id="orgaee7230">Program 4.3 Infix-to-postfix conversion</h4>
<div class="outline-text-4" id="text-orgaee7230">
<ul class="org-ul">
<li>gcc 4-03.c 4-05.c</li>
<li>or</li>
<li>gcc 4-03.c 4-04.c</li>
<li>./a.out "(5 * (((9 + 8) * (4 * 6)) + 7))"</li>
<li>=&gt; 5 9 8 + 4 6 * * 7 + *</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">Program 4.3 Infix-to-postfix conversion </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;string.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"Item.h"</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"STACK.h"</span>

<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">a</span> = argv[1];
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">N</span> = strlen(a);
    STACKinit(N);
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; N; i++) {
        <span style="color: #56b4e9; font-weight: bold;">if</span> (a[i] == <span style="color: #848ea9;">')'</span>)
            printf(<span style="color: #848ea9;">"%c "</span>, STACKpop());
        <span style="color: #56b4e9; font-weight: bold;">if</span> ((a[i] == <span style="color: #848ea9;">'+'</span>) || (a[i] == <span style="color: #848ea9;">'*'</span>))
            STACKpush(a[i]);
        <span style="color: #56b4e9; font-weight: bold;">if</span> ((a[i] &gt;= <span style="color: #848ea9;">'0'</span>) &amp;&amp; (a[i] &lt;= <span style="color: #848ea9;">'9'</span>))
            printf(<span style="color: #848ea9;">"%c "</span>, a[i]);
    }
    printf(<span style="color: #848ea9;">"\n"</span>);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org63e764d" class="outline-3">
<h3 id="org63e764d">4.4 Stack ADT Implementations</h3>
<div class="outline-text-3" id="text-org63e764d">
</div>
<div id="outline-container-org5e6dadf" class="outline-4">
<h4 id="org5e6dadf">Program 4.4 Array implementation of a pushdown stack</h4>
<div class="outline-text-4" id="text-org5e6dadf">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">Array implementation of a pushdown stack </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"Item.h"</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"STACK.h"</span>

<span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">Item</span> *<span style="color: #e69f00; font-weight: bold;">s</span>;
<span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">N</span>;

<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">STACKinit</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">maxN</span>)
{
    s = malloc(<span style="color: #0072b2; font-weight: bold;">maxN</span> * <span style="color: #56b4e9; font-weight: bold;">sizeof</span>(Item));
    N = 0;
}

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">STACKempty</span>()
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> N == 0;
}

<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">STACKpush</span>(<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">item</span>)
{
    s[N++] = item;
}

<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #d55e00;">STACKpop</span>()
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> s[--N];
}
</pre>
</div>
</div>
</div>
