programming/c/code/algorithms.org
*** Program 4.5 Linked-list implementation of a pushdown stack

#+BEGIN_SRC c :mkdirp yes :tangle stack/4-05.c
  /* Linked-list implementation of a pushdown stack */

  #include <stdlib.h>
  #include "Item.h"

  typedef struct STACKnode *link;

  struct STACKnode {
      Item item;
      link next;
  };

  static link head;

  link NEW(Item item, link next)
  {
      link x = malloc(sizeof *x);
      x->item = item;
      x->next = next;
      return x;
  }

  void STACKinit(int maxN)
  {
      head = NULL;
  }

  int STACKempty()
  {
      return head == NULL;
  }

  STACKpush(Item item)
  {
      head = NEW(item, head);
  }

  Item STACKpop()
  {
      Item item = head->item;
      link t = head->next;
      free(head);
      head = t;
      return item;
  }
#+END_SRC

** 4.5 Creation of a New ADT

*** Program 4.6 Equivalence-relations ADT interface

#+BEGIN_SRC c :mkdirp yes :tangle uf/UF.h
  void UFinit(int);
  int UFfind(int, int);
  int UFunion(int, int);
#+END_SRC

*** Program 4.7 Equivalence-relations ADT client

- gcc 4-07.c 4-08.c
- ./a.out 3 4
  - same as the examples in chapter 1

#+BEGIN_SRC c :mkdirp yes :tangle uf/4-07.c
  #include <stdio.h>
  #include "UF.h"

  main(int argc, char *argv[])
  {
      int p, q, N = atoi(argv[1]);
      UFinit(N);
      while (scanf("%d %d", &p, &q) == 2)
          if (!UFfind(p, q)) {
              UFunion(p, q);
              printf(" %d %d\n", p, q);
          }
  }
#+END_SRC

*** Program 4.8 Equivalence-relations ADT implementation

#+BEGIN_SRC c :mkdirp yes :tangle uf/4-08.c
  #include <stdlib.h>
  #include "UF.h"

  static int *id, *sz;

  void UFinit(int N)
  {
      int i;
      id = malloc(N * sizeof(int));
      sz = malloc(N * sizeof(int));
      for (i = 0; i < N; i++) {
          id[i] = i;
          sz[i] = 1;
      }
  }

  int find(int x)
  {
      int i = x;
      while (i != id[i])
          i = id[i];
      return i;
  }

  int UFfind(int p, int q)
  {
      return (find(p) == find(q));
  }

  int UFunion(int p, int q)
  {
      int i = find(p), j = find(q);
      if (i == j)
          return;
      if (sz[i] < sz[j]) {
          id[i] = j;
          sz[j] += sz[i];
      } else {
          id[j] = i;
          sz[i] += sz[j];
      }
  }
#+END_SRC

** 4.6 FIFO Queues and Generalized Queues

*** Program 4.9 FIFO queue ADT interface

#+BEGIN_SRC c :mkdirp yes :tangle fifo/QUEUE.h
  void QUEUEinit(int);
  int QUEUEempty();
  void QUEUEput(Item);
  Item QUEUEget();
#+END_SRC

