programming/c/code/algorithms.html

<div id="outline-container-org0f0c7ea" class="outline-4">
<h4 id="org0f0c7ea">Program 4.5 Linked-list implementation of a pushdown stack</h4>
<div class="outline-text-4" id="text-org0f0c7ea">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">Linked-list implementation of a pushdown stack </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"Item.h"</span>

<span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">STACKnode</span> *<span style="color: #0072b2; font-weight: bold;">link</span>;

<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">STACKnode</span> {
    <span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">item</span>;
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">next</span>;
};

<span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">head</span>;

<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #d55e00;">NEW</span>(<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">item</span>, <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">next</span>)
{
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">x</span> = malloc(<span style="color: #56b4e9; font-weight: bold;">sizeof</span> *x);
    x-&gt;item = item;
    x-&gt;next = next;
    <span style="color: #56b4e9; font-weight: bold;">return</span> x;
}

<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">STACKinit</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">maxN</span>)
{
    head = <span style="color: #d55e00; font-weight: bold;">NULL</span>;
}

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">STACKempty</span>()
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> head == <span style="color: #d55e00; font-weight: bold;">NULL</span>;
}

<span style="color: #d55e00;">STACKpush</span>(<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">item</span>)
{
    head = NEW(item, head);
}

<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #d55e00;">STACKpop</span>()
{
    <span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">item</span> = head-&gt;item;
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">t</span> = head-&gt;next;
    free(head);
    head = t;
    <span style="color: #56b4e9; font-weight: bold;">return</span> item;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbe14b23" class="outline-3">
<h3 id="orgbe14b23">4.5 Creation of a New ADT</h3>
<div class="outline-text-3" id="text-orgbe14b23">
</div>
<div id="outline-container-org4220bc4" class="outline-4">
<h4 id="org4220bc4">Program 4.6 Equivalence-relations ADT interface</h4>
<div class="outline-text-4" id="text-org4220bc4">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">UFinit</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">UFfind</span>(<span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">UFunion</span>(<span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">int</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdafd765" class="outline-4">
<h4 id="orgdafd765">Program 4.7 Equivalence-relations ADT client</h4>
<div class="outline-text-4" id="text-orgdafd765">
<ul class="org-ul">
<li>gcc 4-07.c 4-08.c</li>
<li>./a.out 3 4
<ul class="org-ul">
<li>same as the examples in chapter 1</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"UF.h"</span>

<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">p</span>, <span style="color: #e69f00; font-weight: bold;">q</span>, <span style="color: #e69f00; font-weight: bold;">N</span> = atoi(argv[1]);
    UFinit(N);
    <span style="color: #56b4e9; font-weight: bold;">while</span> (scanf(<span style="color: #848ea9;">"%d %d"</span>, &amp;p, &amp;q) == 2)
        <span style="color: #56b4e9; font-weight: bold;">if</span> (!UFfind(p, q)) {
            UFunion(p, q);
            printf(<span style="color: #848ea9;">" %d %d\n"</span>, p, q);
        }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org78561d8" class="outline-4">
<h4 id="org78561d8">Program 4.8 Equivalence-relations ADT implementation</h4>
<div class="outline-text-4" id="text-org78561d8">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"UF.h"</span>

<span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">int</span> *<span style="color: #e69f00; font-weight: bold;">id</span>, *<span style="color: #e69f00; font-weight: bold;">sz</span>;

<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">UFinit</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">N</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;
    id = malloc(<span style="color: #0072b2; font-weight: bold;">N</span> * <span style="color: #56b4e9; font-weight: bold;">sizeof</span>(<span style="color: #0072b2; font-weight: bold;">int</span>));
    sz = malloc(<span style="color: #0072b2; font-weight: bold;">N</span> * <span style="color: #56b4e9; font-weight: bold;">sizeof</span>(<span style="color: #0072b2; font-weight: bold;">int</span>));
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; N; i++) {
        id[i] = i;
        sz[i] = 1;
    }
}

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">find</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">x</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span> = x;
    <span style="color: #56b4e9; font-weight: bold;">while</span> (i != id[i])
        i = id[i];
    <span style="color: #56b4e9; font-weight: bold;">return</span> i;
}

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">UFfind</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">p</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">q</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> (find(p) == find(q));
}

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">UFunion</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">p</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">q</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span> = find(p), <span style="color: #e69f00; font-weight: bold;">j</span> = find(q);
    <span style="color: #56b4e9; font-weight: bold;">if</span> (i == j)
        <span style="color: #56b4e9; font-weight: bold;">return</span>;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (sz[i] &lt; sz[j]) {
        id[i] = j;
        sz[j] += sz[i];
    } <span style="color: #56b4e9; font-weight: bold;">else</span> {
        id[j] = i;
        sz[i] += sz[j];
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org61dbe1e" class="outline-3">
<h3 id="org61dbe1e">4.6 FIFO Queues and Generalized Queues</h3>
<div class="outline-text-3" id="text-org61dbe1e">
</div>
<div id="outline-container-org3d1110d" class="outline-4">
<h4 id="org3d1110d">Program 4.9 FIFO queue ADT interface</h4>
<div class="outline-text-4" id="text-org3d1110d">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">QUEUEinit</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">QUEUEempty</span>();
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">QUEUEput</span>(Item);
<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #d55e00;">QUEUEget</span>();
</pre>
</div>
</div>
</div>
