programming/c/code/algorithms.org
*** Program 4.10 FIFO queue linked-list implementation

#+BEGIN_SRC c :mkdirp yes :tangle fifo/4-10.c
  #include <stdlib.h>
  #include "Item.h"
  #include "QUEUE.h"

  typedef struct QUEUEnode *link;

  struct QUEUEnode {
      Item item;
      link next;
  };

  static link head, tail;

  link NEW(Item item, link next)
  {
      link x = malloc(sizeof *x);
      x->item = item;
      x->next = next;
      return x;
  }

  void QUEUEinit(int maxN)
  {
      head = NULL;
  }

  int QUEUEempty()
  {
      return head == NULL;
  }

  QUEUEput(Item item)
  {
      if (head == NULL) {
          head = (tail = NEW(item, head));
          return;
      }
      tail->next = NEW(item, tail->next);
      tail = tail->next;
  }

  Item QUEUEget()
  {
      Item item = head->item;
      link t = head->next;
      free(head);
      head = t;
      return item;
  }
#+END_SRC

*** Program 4.11 FIFO queue array implementation

#+BEGIN_SRC c :mkdirp yes :tangle fifo/4-11.c
  #include <stdlib.h>
  #include "Item.h"

  static Item *q;
  static int N, head, tail;

  void QUEUEinit(int maxN)
  {
      q = malloc((maxN + 1) * sizeof(Item));
      N = maxN + 1;
      head = N;
      tail = 0;
  }

  int QUEUEempty()
  {
      return head % N == tail;
  }

  void QUEUEput(Item item)
  {
      q[tail++] = item;
      tail = tail % N;
  }

  Item QUEUEget()
  {
      head = head % N;
      return q[head++];
  }

#+END_SRC

** 4.7 Duplicate and Index Items

*** Program 4.12 Stack with index items and no duplicates

#+BEGIN_SRC c :mkdirp yes :tangle no-dup-stack/4-12.c
  #include <stdlib.h>

  static int *s, *t;
  static int N;

  void STACKinit(int maxN)
  {
      int i;
      s = malloc(maxN * sizeof(int));
      t = malloc(maxN * sizeof(int));
      for (i = 0; i < maxN; i++)
          t[i] = 0;
      N = 0;
  }

  int STACKempty()
  {
      return !N;
  }

  void STACKpush(int item)
  {
      if (t[item] == 1)
          return;
      s[N++] = item;
      t[item] = 1;
  }

  int STACKpop()
  {
      N--;
      t[s[N]] = 0;
      return s[N];
  }
#+END_SRC

** 4.8 First-Class ADTs

*** Program 4.13 Complex numbers driver (roots of unity)

- gcc 4-13.c 4-15.c -lm

#+BEGIN_EXAMPLE
  ./a.out 8
  8th complex roots of unity
   0  1.000  0.000  1.000  0.000
   1  0.707  0.707  1.000  0.000
   2 -0.000  1.000  1.000  0.000
   3 -0.707  0.707  1.000  0.000
   4 -1.000 -0.000  1.000  0.000
   5 -0.707 -0.707  1.000 -0.000
   6  0.000 -1.000  1.000  0.000
   7  0.707 -0.707  1.000 -0.000
#+END_EXAMPLE

#+BEGIN_SRC c :tangle 4-13.c
  #include <stdio.h>
  #include <math.h>
  #include "COMPLEX.h"

  #define PI 3.141592625

  main(int argc, char *argv[])
  {
      int i, j, N = atoi(argv[1]);
      Complex t, x;
      printf("%dth complex roots of unity\n", N);
      for (i = 0; i < N; i++) {
          float r = 2.0 * PI * i / N;
          t = COMPLEXinit(cos(r), sin(r));
          printf("%2d %6.3f %6.3f ", i, Re(t), Im(t));
          for (x = t, j = 0; j < N - 1; j++)
              x = COMPLEXmult(t, x);
          printf("%6.3f %6.3f\n", Re(x), Im(x));
      }
  }
#+END_SRC

*** Program 4.14 First-class data type for complex numbers

#+BEGIN_SRC c :tangle COMPLEX.h
  typedef struct {
      float Re;
      float Im;
  } Complex;
  Complex COMPLEXinit(float, float);
  float Re(Complex);
  float Im(Complex);
  Complex COMPLEXmult(Complex, Complex);
#+END_SRC

