programming/c/code/algorithms.html

<div id="outline-container-orgf60fa8f" class="outline-4">
<h4 id="orgf60fa8f">Program 4.10 FIFO queue linked-list implementation</h4>
<div class="outline-text-4" id="text-orgf60fa8f">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"Item.h"</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"QUEUE.h"</span>

<span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">QUEUEnode</span> *<span style="color: #0072b2; font-weight: bold;">link</span>;

<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">QUEUEnode</span> {
    <span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">item</span>;
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">next</span>;
};

<span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">head</span>, <span style="color: #e69f00; font-weight: bold;">tail</span>;

<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #d55e00;">NEW</span>(<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">item</span>, <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">next</span>)
{
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">x</span> = malloc(<span style="color: #56b4e9; font-weight: bold;">sizeof</span> *x);
    x-&gt;item = item;
    x-&gt;next = next;
    <span style="color: #56b4e9; font-weight: bold;">return</span> x;
}

<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">QUEUEinit</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">maxN</span>)
{
    head = <span style="color: #d55e00; font-weight: bold;">NULL</span>;
}

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">QUEUEempty</span>()
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> head == <span style="color: #d55e00; font-weight: bold;">NULL</span>;
}

<span style="color: #d55e00;">QUEUEput</span>(<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">item</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">if</span> (head == <span style="color: #d55e00; font-weight: bold;">NULL</span>) {
        head = (tail = NEW(item, head));
        <span style="color: #56b4e9; font-weight: bold;">return</span>;
    }
    tail-&gt;next = NEW(item, tail-&gt;next);
    tail = tail-&gt;next;
}

<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #d55e00;">QUEUEget</span>()
{
    <span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">item</span> = head-&gt;item;
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">t</span> = head-&gt;next;
    free(head);
    head = t;
    <span style="color: #56b4e9; font-weight: bold;">return</span> item;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org170570b" class="outline-4">
<h4 id="org170570b">Program 4.11 FIFO queue array implementation</h4>
<div class="outline-text-4" id="text-org170570b">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"Item.h"</span>

<span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">Item</span> *<span style="color: #e69f00; font-weight: bold;">q</span>;
<span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">N</span>, <span style="color: #e69f00; font-weight: bold;">head</span>, <span style="color: #e69f00; font-weight: bold;">tail</span>;

<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">QUEUEinit</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">maxN</span>)
{
    q = malloc((maxN + 1) * <span style="color: #56b4e9; font-weight: bold;">sizeof</span>(Item));
    N = maxN + 1;
    head = N;
    tail = 0;
}

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">QUEUEempty</span>()
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> head % N == tail;
}

<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">QUEUEput</span>(<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">item</span>)
{
    q[tail++] = item;
    tail = tail % N;
}

<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #d55e00;">QUEUEget</span>()
{
    head = head % N;
    <span style="color: #56b4e9; font-weight: bold;">return</span> q[head++];
}

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org56dee80" class="outline-3">
<h3 id="org56dee80">4.7 Duplicate and Index Items</h3>
<div class="outline-text-3" id="text-org56dee80">
</div>
<div id="outline-container-orgb607b68" class="outline-4">
<h4 id="orgb607b68">Program 4.12 Stack with index items and no duplicates</h4>
<div class="outline-text-4" id="text-orgb607b68">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>

<span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">int</span> *<span style="color: #e69f00; font-weight: bold;">s</span>, *<span style="color: #e69f00; font-weight: bold;">t</span>;
<span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">N</span>;

<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">STACKinit</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">maxN</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;
    s = malloc(<span style="color: #0072b2; font-weight: bold;">maxN</span> * <span style="color: #56b4e9; font-weight: bold;">sizeof</span>(<span style="color: #0072b2; font-weight: bold;">int</span>));
    t = malloc(<span style="color: #0072b2; font-weight: bold;">maxN</span> * <span style="color: #56b4e9; font-weight: bold;">sizeof</span>(<span style="color: #0072b2; font-weight: bold;">int</span>));
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; maxN; i++)
        t[i] = 0;
    N = 0;
}

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">STACKempty</span>()
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> !N;
}

<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">STACKpush</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">item</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">if</span> (t[item] == 1)
        <span style="color: #56b4e9; font-weight: bold;">return</span>;
    s[N++] = item;
    t[item] = 1;
}

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">STACKpop</span>()
{
    N--;
    t[s[N]] = 0;
    <span style="color: #56b4e9; font-weight: bold;">return</span> s[N];
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org70d0832" class="outline-3">
<h3 id="org70d0832">4.8 First-Class ADTs</h3>
<div class="outline-text-3" id="text-org70d0832">
</div>
<div id="outline-container-orgb2e6dfb" class="outline-4">
<h4 id="orgb2e6dfb">Program 4.13 Complex numbers driver (roots of unity)</h4>
<div class="outline-text-4" id="text-orgb2e6dfb">
<ul class="org-ul">
<li>gcc 4-13.c 4-15.c -lm</li>
</ul>

<pre class="example">
./a.out 8
8th complex roots of unity
 0  1.000  0.000  1.000  0.000
 1  0.707  0.707  1.000  0.000
 2 -0.000  1.000  1.000  0.000
 3 -0.707  0.707  1.000  0.000
 4 -1.000 -0.000  1.000  0.000
 5 -0.707 -0.707  1.000 -0.000
 6  0.000 -1.000  1.000  0.000
 7  0.707 -0.707  1.000 -0.000
</pre>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;math.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"COMPLEX.h"</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">PI</span> 3.141592625

<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>, <span style="color: #e69f00; font-weight: bold;">N</span> = atoi(argv[1]);
    <span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #e69f00; font-weight: bold;">t</span>, <span style="color: #e69f00; font-weight: bold;">x</span>;
    printf(<span style="color: #848ea9;">"%dth complex roots of unity\n"</span>, N);
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; N; i++) {
        <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">r</span> = 2.0 * PI * i / N;
        t = COMPLEXinit(cos(r), sin(r));
        printf(<span style="color: #848ea9;">"%2d %6.3f %6.3f "</span>, i, Re(t), Im(t));
        <span style="color: #56b4e9; font-weight: bold;">for</span> (x = t, j = 0; j &lt; N - 1; j++)
            x = COMPLEXmult(t, x);
        printf(<span style="color: #848ea9;">"%6.3f %6.3f\n"</span>, Re(x), Im(x));
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbb5d3fd" class="outline-4">
<h4 id="orgbb5d3fd">Program 4.14 First-class data type for complex numbers</h4>
<div class="outline-text-4" id="text-orgbb5d3fd">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #56b4e9; font-weight: bold;">struct</span> {
    <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">Re</span>;
    <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">Im</span>;
} <span style="color: #0072b2; font-weight: bold;">Complex</span>;
<span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #d55e00;">COMPLEXinit</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #d55e00;">Re</span>(<span style="color: #0072b2; font-weight: bold;">Complex</span>);
<span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #d55e00;">Im</span>(<span style="color: #0072b2; font-weight: bold;">Complex</span>);
<span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #d55e00;">COMPLEXmult</span>(<span style="color: #0072b2; font-weight: bold;">Complex</span>, <span style="color: #0072b2; font-weight: bold;">Complex</span>);
</pre>
</div>
</div>
</div>
