programming/c/code/algorithms.org
*** Program 4.15 Complex-numbers data-type implementation

#+BEGIN_SRC c :tangle 4-15.c
  #include "COMPLEX.h"

  Complex COMPLEXinit(float Re, float Im)
  {
      Complex t;
      t.Re = Re;
      t.Im = Im;
      return t;
  }

  float Re(Complex z)
  {
      return z.Re;
  }

  float Im(Complex z)
  {
      return z.Im;
  }

  Complex COMPLEXmult(Complex a, Complex b)
  {
      Complex t;
      t.Re = a.Re * b.Re - a.Im * b.Im;
      t.Im = a.Re * b.Im + a.Im * b.Re;
      return t;
  }

#+END_SRC

*** Program 4.16 First-class ADT for complex numbers

#+BEGIN_SRC c :tangle aCOMPLEX.h
  typedef struct complex *Complex;
  Complex COMPLEXinit(float, float);
  float Re(Complex);
  float Im(Complex);
  Complex COMPLEXmult(Complex, Complex);
#+END_SRC

*** Program 4.17 Complex-numbers ADT implementation

- use 4-13.c as driver.  need to change COMPLEX.h

#+BEGIN_SRC c :tangle 4-14.c
  #include <stdlib.h>
  #include "aCOMPLEX.h"

  struct complex {
      float Re;
      float Im;
  };

  Complex COMPLEXinit(float Re, float Im)
  {
      Complex t = malloc(sizeof *t);
      t->Re = Re;
      t->Im = Im;
      return t;
  }

  float Re(Complex z)
  {
      return z->Re;
  }

  float Im(Complex z)
  {
      return z->Im;
  }

  Complex COMPLEXmult(Complex a, Complex b)
  {
      return COMPLEXinit(Re(a) * Re(b) - Im(a) * Im(b),
                         Re(a) * Im(b) + Im(a) * Re(b));
  }
#+END_SRC

*** Program 4.18 First-class ADT interface for queues

#+BEGIN_SRC c :tangle aQUEUE.h
  typedef struct queue *Q;
  void QUEUEdump(Q);
  Q QUEUEinit(int maxN);
  int QUEUEempty(Q);
  void QUEUEput(Q, Item);
  Item QUEUEget(Q);
#+END_SRC

*** Program 4.19 Queue client program (queue simulation)

gcc 4-19.c 4-20.c 
./a.out 84

just outputs all zeros.  something wrong somewhere

there are two bugs
missing ; // in notes not in code
j instead of i in both book and code

i don't get the same results that he has in the book
the book looks wrong.  missing numbers 85-89 and has 90

#+BEGIN_SRC c :tangle 4-19.c
  #include <stdio.h>
  #include <stdlib.h>
  #include "Item.h"
  #include "QUEUE.h"

  #define M 10

  main(int argc, char *argv[])
  {
      int i, j, N = atoi(argv[1]);
      Q queues[M];
      for (i = 0; i < M; i++)
          queues[i] = QUEUEinit(N);
      for (i = 0; i < N; i++)
          QUEUEput(queues[rand() % M], j);
      for (i = 0; i < M; i++, printf("\n"))
          for (j = 0; !QUEUEempty(queues[i]); j++)
              printf("%3d ", QUEUEget(queues[i]));
  }
#+END_SRC

