programming/c/code/algorithms.html

<div id="outline-container-org31f0cb1" class="outline-4">
<h4 id="org31f0cb1">Program 4.15 Complex-numbers data-type implementation</h4>
<div class="outline-text-4" id="text-org31f0cb1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"COMPLEX.h"</span>

<span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #d55e00;">COMPLEXinit</span>(<span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">Re</span>, <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">Im</span>)
{
    <span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #e69f00; font-weight: bold;">t</span>;
    t.Re = Re;
    t.Im = Im;
    <span style="color: #56b4e9; font-weight: bold;">return</span> t;
}

<span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #d55e00;">Re</span>(<span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #e69f00; font-weight: bold;">z</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> z.Re;
}

<span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #d55e00;">Im</span>(<span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #e69f00; font-weight: bold;">z</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> z.Im;
}

<span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #d55e00;">COMPLEXmult</span>(<span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #e69f00; font-weight: bold;">a</span>, <span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #e69f00; font-weight: bold;">b</span>)
{
    <span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #e69f00; font-weight: bold;">t</span>;
    t.Re = a.Re * b.Re - a.Im * b.Im;
    t.Im = a.Re * b.Im + a.Im * b.Re;
    <span style="color: #56b4e9; font-weight: bold;">return</span> t;
}

</pre>
</div>
</div>
</div>

<div id="outline-container-org28a1421" class="outline-4">
<h4 id="org28a1421">Program 4.16 First-class ADT for complex numbers</h4>
<div class="outline-text-4" id="text-org28a1421">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">complex</span> *<span style="color: #0072b2; font-weight: bold;">Complex</span>;
<span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #d55e00;">COMPLEXinit</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #d55e00;">Re</span>(<span style="color: #0072b2; font-weight: bold;">Complex</span>);
<span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #d55e00;">Im</span>(<span style="color: #0072b2; font-weight: bold;">Complex</span>);
<span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #d55e00;">COMPLEXmult</span>(<span style="color: #0072b2; font-weight: bold;">Complex</span>, <span style="color: #0072b2; font-weight: bold;">Complex</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb92aeed" class="outline-4">
<h4 id="orgb92aeed">Program 4.17 Complex-numbers ADT implementation</h4>
<div class="outline-text-4" id="text-orgb92aeed">
<ul class="org-ul">
<li>use 4-13.c as driver.  need to change COMPLEX.h</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"aCOMPLEX.h"</span>

<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">complex</span> {
    <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">Re</span>;
    <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">Im</span>;
};

<span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #d55e00;">COMPLEXinit</span>(<span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">Re</span>, <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">Im</span>)
{
    <span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #e69f00; font-weight: bold;">t</span> = malloc(<span style="color: #56b4e9; font-weight: bold;">sizeof</span> *t);
    t-&gt;Re = Re;
    t-&gt;Im = Im;
    <span style="color: #56b4e9; font-weight: bold;">return</span> t;
}

<span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #d55e00;">Re</span>(<span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #e69f00; font-weight: bold;">z</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> z-&gt;Re;
}

<span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #d55e00;">Im</span>(<span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #e69f00; font-weight: bold;">z</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> z-&gt;Im;
}

<span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #d55e00;">COMPLEXmult</span>(<span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #e69f00; font-weight: bold;">a</span>, <span style="color: #0072b2; font-weight: bold;">Complex</span> <span style="color: #e69f00; font-weight: bold;">b</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> COMPLEXinit(Re(a) * Re(b) - Im(a) * Im(b),
                       Re(a) * Im(b) + Im(a) * Re(b));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org75138a0" class="outline-4">
<h4 id="org75138a0">Program 4.18 First-class ADT interface for queues</h4>
<div class="outline-text-4" id="text-org75138a0">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">queue</span> *<span style="color: #0072b2; font-weight: bold;">Q</span>;
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">QUEUEdump</span>(<span style="color: #0072b2; font-weight: bold;">Q</span>);
<span style="color: #0072b2; font-weight: bold;">Q</span> <span style="color: #d55e00;">QUEUEinit</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">maxN</span>);
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">QUEUEempty</span>(<span style="color: #0072b2; font-weight: bold;">Q</span>);
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">QUEUEput</span>(<span style="color: #0072b2; font-weight: bold;">Q</span>, Item);
<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #d55e00;">QUEUEget</span>(<span style="color: #0072b2; font-weight: bold;">Q</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-org34404c0" class="outline-4">
<h4 id="org34404c0">Program 4.19 Queue client program (queue simulation)</h4>
<div class="outline-text-4" id="text-org34404c0">
<p>
gcc 4-19.c 4-20.c 
./a.out 84
</p>

<p>
just outputs all zeros.  something wrong somewhere
</p>

<p>
there are two bugs
missing ; // in notes not in code
j instead of i in both book and code
</p>

<p>
i don't get the same results that he has in the book
the book looks wrong.  missing numbers 85-89 and has 90
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"Item.h"</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"QUEUE.h"</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">M</span> 10

<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>, <span style="color: #e69f00; font-weight: bold;">N</span> = atoi(argv[1]);
    <span style="color: #0072b2; font-weight: bold;">Q</span> <span style="color: #e69f00; font-weight: bold;">queues</span>[M];
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; M; i++)
        queues[i] = QUEUEinit(N);
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; N; i++)
        QUEUEput(queues[rand() % M], j);
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; M; i++, printf(<span style="color: #848ea9;">"\n"</span>))
        <span style="color: #56b4e9; font-weight: bold;">for</span> (j = 0; !QUEUEempty(queues[i]); j++)
            printf(<span style="color: #848ea9;">"%3d "</span>, QUEUEget(queues[i]));
}
</pre>
</div>
</div>
</div>
