programming/c/code/algorithms.org
*** Program 4.20 Linked-list implementation of first-class queue

#+BEGIN_SRC c :tangle 4-20.c
  #include <stdlib.h>
  #include "Item.h"
  #include "QUEUE.h"

  typedef struct QUEUEnode *link;

  struct QUEUEnode {
      Item item;
      link next;
  };

  struct queue {
      link head;
      link tail;
  };

  link NEW(Item item, link next)
  {
      link x = malloc(sizeof *x);
      x->item = item;
      x->next = next;
      return x;
  }

  Q QUEUEinit(int maxN)
  {
      Q q = malloc(sizeof *q);
      q->head = NULL;
      q->tail = NULL;
      return q;
  }

  int QUEUEempty(Q q)
  {
      return q->head == NULL;
  }

  void QUEUEput(Q q, Item item)
  {
      if (q->head == NULL) {
          q->tail = NEW(item, q->head)
              q->head = q->tail;
          return;
      }
      q->tail->next = NEW(item, q->tail->next);
      q->tail = q->tail->next;
  }

  Item QUEUEget(Q q)
  {
      Item item = q->head->item;
      link t = q->head->next;
      free(q->head);
      q->head = t;
      return item;
  }
#+END_SRC

** 4.9 Application-Based ADT Example

*** Program 4.21 Polynomial client (binomial coefficients)

#+BEGIN_SRC c :tangle 4-21.c
  #include <stdio.h>
  #include <stdlib.h>
  #include "POLY.h"

  main(int argc, char *argv[])
  {
      int N = atoi(argv[1]);
      float p = atof(argv[2]);
      Poly t, x;
      int i, j;
      printf("Binomial coefficients\n");
      t = POLYadd(POLYterm(1, 1), POLYterm(1, 0));
      for (i = 0, x = t; i < N; i++) {
          x = POLYmult(t, x);
          showPOLY(x);
      }
      printf("%f\n", POLYeval(x, p));
  }
#+END_SRC

*** Program 4.22 First-class ADT interface for polynomials

#+BEGIN_SRC c :tangle POLY.h
  typedef struct poly *Poly;
  void showPOLY(Poly);
  Poly POLYterm(int, int);
  Poly POLYadd(Poly, Poly);
  Poly POLYmult(Poly, Poly);
  float POLYeval(Poly, float);
#+END_SRC

