programming/c/code/algorithms.html

<div id="outline-container-orgf276232" class="outline-4">
<h4 id="orgf276232">Program 4.20 Linked-list implementation of first-class queue</h4>
<div class="outline-text-4" id="text-orgf276232">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"Item.h"</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"QUEUE.h"</span>

<span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">QUEUEnode</span> *<span style="color: #0072b2; font-weight: bold;">link</span>;

<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">QUEUEnode</span> {
    <span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">item</span>;
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">next</span>;
};

<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">queue</span> {
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">head</span>;
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">tail</span>;
};

<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #d55e00;">NEW</span>(<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">item</span>, <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">next</span>)
{
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">x</span> = malloc(<span style="color: #56b4e9; font-weight: bold;">sizeof</span> *x);
    x-&gt;item = item;
    x-&gt;next = next;
    <span style="color: #56b4e9; font-weight: bold;">return</span> x;
}

<span style="color: #0072b2; font-weight: bold;">Q</span> <span style="color: #d55e00;">QUEUEinit</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">maxN</span>)
{
    <span style="color: #0072b2; font-weight: bold;">Q</span> <span style="color: #e69f00; font-weight: bold;">q</span> = malloc(<span style="color: #56b4e9; font-weight: bold;">sizeof</span> *q);
    q-&gt;head = <span style="color: #d55e00; font-weight: bold;">NULL</span>;
    q-&gt;tail = <span style="color: #d55e00; font-weight: bold;">NULL</span>;
    <span style="color: #56b4e9; font-weight: bold;">return</span> q;
}

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">QUEUEempty</span>(<span style="color: #0072b2; font-weight: bold;">Q</span> <span style="color: #e69f00; font-weight: bold;">q</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> q-&gt;head == <span style="color: #d55e00; font-weight: bold;">NULL</span>;
}

<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">QUEUEput</span>(<span style="color: #0072b2; font-weight: bold;">Q</span> <span style="color: #e69f00; font-weight: bold;">q</span>, <span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">item</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">if</span> (q-&gt;head == <span style="color: #d55e00; font-weight: bold;">NULL</span>) {
        q-&gt;tail = NEW(item, q-&gt;head)
            q-&gt;head = q-&gt;tail;
        <span style="color: #56b4e9; font-weight: bold;">return</span>;
    }
    q-&gt;tail-&gt;next = NEW(item, q-&gt;tail-&gt;next);
    q-&gt;tail = q-&gt;tail-&gt;next;
}

<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #d55e00;">QUEUEget</span>(<span style="color: #0072b2; font-weight: bold;">Q</span> <span style="color: #e69f00; font-weight: bold;">q</span>)
{
    <span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">item</span> = q-&gt;head-&gt;item;
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">t</span> = q-&gt;head-&gt;next;
    free(q-&gt;head);
    q-&gt;head = t;
    <span style="color: #56b4e9; font-weight: bold;">return</span> item;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org94521d6" class="outline-3">
<h3 id="org94521d6">4.9 Application-Based ADT Example</h3>
<div class="outline-text-3" id="text-org94521d6">
</div>
<div id="outline-container-orga952c0c" class="outline-4">
<h4 id="orga952c0c">Program 4.21 Polynomial client (binomial coefficients)</h4>
<div class="outline-text-4" id="text-orga952c0c">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"POLY.h"</span>

<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">N</span> = atoi(argv[1]);
    <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">p</span> = atof(argv[2]);
    <span style="color: #0072b2; font-weight: bold;">Poly</span> <span style="color: #e69f00; font-weight: bold;">t</span>, <span style="color: #e69f00; font-weight: bold;">x</span>;
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>;
    printf(<span style="color: #848ea9;">"Binomial coefficients\n"</span>);
    t = POLYadd(POLYterm(1, 1), POLYterm(1, 0));
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0, x = t; i &lt; N; i++) {
        x = POLYmult(t, x);
        showPOLY(x);
    }
    printf(<span style="color: #848ea9;">"%f\n"</span>, POLYeval(x, p));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org97c2982" class="outline-4">
<h4 id="org97c2982">Program 4.22 First-class ADT interface for polynomials</h4>
<div class="outline-text-4" id="text-org97c2982">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">poly</span> *<span style="color: #0072b2; font-weight: bold;">Poly</span>;
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">showPOLY</span>(<span style="color: #0072b2; font-weight: bold;">Poly</span>);
<span style="color: #0072b2; font-weight: bold;">Poly</span> <span style="color: #d55e00;">POLYterm</span>(<span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">Poly</span> <span style="color: #d55e00;">POLYadd</span>(<span style="color: #0072b2; font-weight: bold;">Poly</span>, <span style="color: #0072b2; font-weight: bold;">Poly</span>);
<span style="color: #0072b2; font-weight: bold;">Poly</span> <span style="color: #d55e00;">POLYmult</span>(<span style="color: #0072b2; font-weight: bold;">Poly</span>, <span style="color: #0072b2; font-weight: bold;">Poly</span>);
<span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #d55e00;">POLYeval</span>(<span style="color: #0072b2; font-weight: bold;">Poly</span>, <span style="color: #0072b2; font-weight: bold;">float</span>);
</pre>
</div>
</div>
</div>
