programming/c/code/algorithms.org
*** Program 4.23 Array implementation of polynomial ADT

there is no void showPOLY(Poly);

#+BEGIN_SRC c :tangle 4-23.c
  #include <stdlib.h>
  #include "POLY.h"

  struct poly {
      int N;
      int *a;
  };

  Poly POLYterm(int coeff, int exp)
  {
      int i;
      Poly t = malloc(sizeof *t);
      t->a = malloc((exp + 1) * sizeof(int));
      t->N = exp + 1;
      t->a[exp] = coeff;
      for (i = 0; i < exp; i++)
          t->a[i] = 0;
      return t;
  }

  Poly POLYadd(Poly p, Poly q)
  {
      int i;
      Poly t;
      if (p->N < q->N) {
          t = p;
          p = q;
          q = t;
      }
      for (i = 0; i < q->N; i++)
          p->a[i] += q->a[i];
      return p;
  }

  Poly POLYmult(Poly p, Poly q)
  {
      int i, j;
      Poly t = POLYterm(0, (p->N - 1) + (q->N - 1));
      for (i = 0; i < p->N; i++)
          for (j = 0; j < q->N; j++)
              t->a[i + j] += p->a[i] * q->a[j];
      return t;
  }

  float POLYeval(Poly p, float x)
  {
      int i;
      double t = 0.0;
      for (i = p->N - 1; i >= 0; i--)
          t = t * x + p->a[i];
      return t;
  }
#+END_SRC

** 4.10 Perspective

no code

* Chapter 5. Recursion and Trees

** 5.1 Recursive Algorithms

*** Program 5.1 Factorial function (recursive implementation)

#+BEGIN_SRC c :mkdirp yes :tangle factorial/5-01.c
  /* Factorial function (recursive implementation) */
  int factorial(int N)
  {
      if (N == 0)
          return 1;
      return N * factorial(N - 1);
  }
#+END_SRC

*** Program 5.2 A questionable recursive program

#+BEGIN_SRC c :mkdirp yes :tangle puzzle/5-02.c
  /* A questionable recursive program */
  int puzzle(int N)
  {
      if (N == 1)
          return 1;
      if (N % 2 == 0)
          return puzzle(N / 2);
      else
          return puzzle(3 * N + 1);
  }
#+END_SRC

*** Program 5.3 Euclid's algorithm

#+BEGIN_SRC c :mkdirp yes :tangle euclid/5-03.c
  /* Euclid's algorithm */
  int gcd(int m, int n)
  {
      if (n == 0)
          return m;
      return gcd(n, m % n);
  }
#+END_SRC

*** Program 5.4 Recursive program to evaluate prefix expressions

works. but can't figure how to print the value of the runnning total

#+BEGIN_SRC c :mkdirp yes :tangle prefix-exp/5-04.c
  /* Recursive program to evaluate prefix expressions */
  char *a;
  int i;
  int eval()
  {
      int x = 0;
      while (a[i] == ' ')
          i++;
      if (a[i] == '+') {
          i++;
          return eval() + eval();
      }
      if (a[i] == '*') {
          i++;
          return eval() * eval();
      }
      while ((a[i] >= '0') && (a[i] <= '9'))
          x = 10 * x + (a[i++] - '0');
      return x;
  }
#+END_SRC

