programming/c/code/algorithms.html

<div id="outline-container-org2460a1e" class="outline-4">
<h4 id="org2460a1e">Program 4.23 Array implementation of polynomial ADT</h4>
<div class="outline-text-4" id="text-org2460a1e">
<p>
there is no void showPOLY(Poly);
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"POLY.h"</span>

<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">poly</span> {
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">N</span>;
    <span style="color: #0072b2; font-weight: bold;">int</span> *<span style="color: #e69f00; font-weight: bold;">a</span>;
};

<span style="color: #0072b2; font-weight: bold;">Poly</span> <span style="color: #d55e00;">POLYterm</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">coeff</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">exp</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;
    <span style="color: #0072b2; font-weight: bold;">Poly</span> <span style="color: #e69f00; font-weight: bold;">t</span> = malloc(<span style="color: #56b4e9; font-weight: bold;">sizeof</span> *t);
    t-&gt;a = malloc((exp + 1) * <span style="color: #56b4e9; font-weight: bold;">sizeof</span>(<span style="color: #0072b2; font-weight: bold;">int</span>));
    t-&gt;N = exp + 1;
    t-&gt;a[exp] = coeff;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; exp; i++)
        t-&gt;a[i] = 0;
    <span style="color: #56b4e9; font-weight: bold;">return</span> t;
}

<span style="color: #0072b2; font-weight: bold;">Poly</span> <span style="color: #d55e00;">POLYadd</span>(<span style="color: #0072b2; font-weight: bold;">Poly</span> <span style="color: #e69f00; font-weight: bold;">p</span>, <span style="color: #0072b2; font-weight: bold;">Poly</span> <span style="color: #e69f00; font-weight: bold;">q</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;
    <span style="color: #0072b2; font-weight: bold;">Poly</span> <span style="color: #e69f00; font-weight: bold;">t</span>;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (p-&gt;N &lt; q-&gt;N) {
        t = p;
        p = q;
        q = t;
    }
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; q-&gt;N; i++)
        p-&gt;a[i] += q-&gt;a[i];
    <span style="color: #56b4e9; font-weight: bold;">return</span> p;
}

<span style="color: #0072b2; font-weight: bold;">Poly</span> <span style="color: #d55e00;">POLYmult</span>(<span style="color: #0072b2; font-weight: bold;">Poly</span> <span style="color: #e69f00; font-weight: bold;">p</span>, <span style="color: #0072b2; font-weight: bold;">Poly</span> <span style="color: #e69f00; font-weight: bold;">q</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>;
    <span style="color: #0072b2; font-weight: bold;">Poly</span> <span style="color: #e69f00; font-weight: bold;">t</span> = POLYterm(0, (p-&gt;N - 1) + (q-&gt;N - 1));
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; p-&gt;N; i++)
        <span style="color: #56b4e9; font-weight: bold;">for</span> (j = 0; j &lt; q-&gt;N; j++)
            t-&gt;a[i + j] += p-&gt;a[i] * q-&gt;a[j];
    <span style="color: #56b4e9; font-weight: bold;">return</span> t;
}

<span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #d55e00;">POLYeval</span>(<span style="color: #0072b2; font-weight: bold;">Poly</span> <span style="color: #e69f00; font-weight: bold;">p</span>, <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">x</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;
    <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">t</span> = 0.0;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = p-&gt;N - 1; i &gt;= 0; i--)
        t = t * x + p-&gt;a[i];
    <span style="color: #56b4e9; font-weight: bold;">return</span> t;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfd254e9" class="outline-3">
<h3 id="orgfd254e9">4.10 Perspective</h3>
<div class="outline-text-3" id="text-orgfd254e9">
<p>
no code
</p>
</div>
</div>
</div>

<div id="outline-container-org8304a38" class="outline-2">
<h2 id="org8304a38">Chapter 5. Recursion and Trees</h2>
<div class="outline-text-2" id="text-org8304a38">
</div>
<div id="outline-container-org02b8fce" class="outline-3">
<h3 id="org02b8fce">5.1 Recursive Algorithms</h3>
<div class="outline-text-3" id="text-org02b8fce">
</div>
<div id="outline-container-org3b8fdce" class="outline-4">
<h4 id="org3b8fdce">Program 5.1 Factorial function (recursive implementation)</h4>
<div class="outline-text-4" id="text-org3b8fdce">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">Factorial function (recursive implementation) </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">factorial</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">N</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">if</span> (N == 0)
        <span style="color: #56b4e9; font-weight: bold;">return</span> 1;
    <span style="color: #56b4e9; font-weight: bold;">return</span> N * factorial(N - 1);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge55037f" class="outline-4">
<h4 id="orge55037f">Program 5.2 A questionable recursive program</h4>
<div class="outline-text-4" id="text-orge55037f">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">A questionable recursive program </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">puzzle</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">N</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">if</span> (N == 1)
        <span style="color: #56b4e9; font-weight: bold;">return</span> 1;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (N % 2 == 0)
        <span style="color: #56b4e9; font-weight: bold;">return</span> puzzle(N / 2);
    <span style="color: #56b4e9; font-weight: bold;">else</span>
        <span style="color: #56b4e9; font-weight: bold;">return</span> puzzle(3 * N + 1);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf009ecf" class="outline-4">
<h4 id="orgf009ecf">Program 5.3 Euclid's algorithm</h4>
<div class="outline-text-4" id="text-orgf009ecf">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">Euclid's algorithm </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">gcd</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">m</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">n</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">if</span> (n == 0)
        <span style="color: #56b4e9; font-weight: bold;">return</span> m;
    <span style="color: #56b4e9; font-weight: bold;">return</span> gcd(n, m % n);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org43b632c" class="outline-4">
<h4 id="org43b632c">Program 5.4 Recursive program to evaluate prefix expressions</h4>
<div class="outline-text-4" id="text-org43b632c">
<p>
works. but can't figure how to print the value of the runnning total
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">Recursive program to evaluate prefix expressions </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">a</span>;
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">eval</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">x</span> = 0;
    <span style="color: #56b4e9; font-weight: bold;">while</span> (a[i] == <span style="color: #848ea9;">' '</span>)
        i++;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (a[i] == <span style="color: #848ea9;">'+'</span>) {
        i++;
        <span style="color: #56b4e9; font-weight: bold;">return</span> eval() + eval();
    }
    <span style="color: #56b4e9; font-weight: bold;">if</span> (a[i] == <span style="color: #848ea9;">'*'</span>) {
        i++;
        <span style="color: #56b4e9; font-weight: bold;">return</span> eval() * eval();
    }
    <span style="color: #56b4e9; font-weight: bold;">while</span> ((a[i] &gt;= <span style="color: #848ea9;">'0'</span>) &amp;&amp; (a[i] &lt;= <span style="color: #848ea9;">'9'</span>))
        x = 10 * x + (a[i++] - <span style="color: #848ea9;">'0'</span>);
    <span style="color: #56b4e9; font-weight: bold;">return</span> x;
}
</pre>
</div>
</div>
</div>
