programming/c/code/algorithms.org
*** Program 5.5 Examples of recursive functions for linked lists

#+BEGIN_SRC c :mkdirp yes :tangle linked-list/5-05.c
int count(link x)
  { 
    if (x == NULL) return 0;
    return 1 + count(x->next); 
  }
void traverse(link h, void (*visit)(link))
  { 
    if (h == NULL) return;
    (*visit)(h); 
    traverse(h->next, visit);
  }
void traverseR(link h, void (*visit)(link))
  { 
    if (h == NULL) return;
    traverseR(h->next, visit);
    (*visit)(h); 
  }
link delete(link x, Item v)
  { 
    if (x == NULL) return NULL;
    if (eq(x->item, v))
      { link t = x->next; free(x); return t; }
    x->next = delete(x->next, v);
    return x;
  }
#+END_SRC

** 5.2 Divide and Conquer

*** Program 5.6 Divide-and-conquer to find the maximum

#+BEGIN_SRC c :mkdirp yes :tangle divide/5-06.c
  /* Divide-and-conquer to find the maximum */
  Item max(Item a[], int l, int r)
  {
      Item u, v;
      int m = (l + r) / 2;
      if (l == r)
          return a[l];
      u = max(a, l, m);
      v = max(a, m + 1, r);
      if (u > v)
          return u;
      else
          return v;
  }
#+END_SRC

*** Program 5.7 Solution to the towers of Hanoi

#+BEGIN_SRC c :mkdirp yes :tangle towers-of-hanoi/5-07.c
  void hanoi(int N, int d)
  {
      if (N == 0)
          return;
      hanoi(N - 1, -d);
      shift(N, d);
      hanoi(N - 1, -d);
  }
#+END_SRC

*** Program 5.8 Divide and conquer to draw a ruler

#+BEGIN_SRC c :mkdirp yes :tangle ruler/5-08.c
rule(int l, int r, int h)
  { int m = (l+r)/2;
    if (h > 0)
      { 
        rule(l, m, h-1);
        mark(m, h);
        rule(m, r, h-1);
      }
  }
#+END_SRC

*** Program 5.9 Nonrecursive program to draw a ruler

#+BEGIN_SRC c :mkdirp yes :tangle ruler/5-09.c
rule(int l, int r, int h)
  { 
    int i, j, t;
    for (t = 1, j = 1; t <= h; j += j, t++)
      for (i = 0; l+j+i <= r; i += j+j)
        mark(l+j+i, t);
  }
#+END_SRC

** 5.3 Dynamic Programming

*** Program 5.10 Fibonacci numbers (recursive implementation)

"This program is not usable because it takes exponential time to
compute FN."

#+BEGIN_SRC c :mkdirp yes :tangle 5-10.c
int F(int i)
  { 
    if (i < 1) return 0;
    if (i == 1) return 1;
    return F(i-1) + F(i-2);
  }
#+END_SRC

*** Program 5.11 Fibonacci numbers (dynamic programming)

#+BEGIN_SRC c :mkdirp yes :tangle 5-11.c
int F(int i)
  { int t;
    if (knownF[i] != unknown) return knownF[i];
    if (i == 0) t = 0;
    if (i == 1) t = 1;
    if (i > 1) t = F(i-1) + F(i-2);
    return knownF[i] = t; 
  }
#+END_SRC

*** Program 5.12 Knapsack problem (recursive implementation)

"do not use this program, because it will take exponential time"

#+BEGIN_SRC c :mkdirp yes :tangle 5-12.c
int knap(int cap)
  { int i, space, max, t;
    for (i = 0, max = 0; i < N; i++)
      if ((space = cap-items[i].size) >= 0)
        if ((t = knap(space) + items[i].val) > max) 
          max = t;
    return max;     
  }
#+END_SRC

