programming/c/code/algorithms.html

<div id="outline-container-org870ea21" class="outline-4">
<h4 id="org870ea21">Program 5.5 Examples of recursive functions for linked lists</h4>
<div class="outline-text-4" id="text-org870ea21">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">count</span>(<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">x</span>)
  { 
    <span style="color: #56b4e9; font-weight: bold;">if</span> (x == <span style="color: #d55e00; font-weight: bold;">NULL</span>) <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
    <span style="color: #56b4e9; font-weight: bold;">return</span> 1 + count(x-&gt;next); 
  }
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">traverse</span>(<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">h</span>, <span style="color: #0072b2; font-weight: bold;">void</span> (*<span style="color: #d55e00;">visit</span>)(<span style="color: #0072b2; font-weight: bold;">link</span>))
  { 
    <span style="color: #56b4e9; font-weight: bold;">if</span> (h == <span style="color: #d55e00; font-weight: bold;">NULL</span>) <span style="color: #56b4e9; font-weight: bold;">return</span>;
    (*visit)(h); 
    traverse(h-&gt;next, visit);
  }
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">traverseR</span>(<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">h</span>, <span style="color: #0072b2; font-weight: bold;">void</span> (*<span style="color: #d55e00;">visit</span>)(<span style="color: #0072b2; font-weight: bold;">link</span>))
  { 
    <span style="color: #56b4e9; font-weight: bold;">if</span> (h == <span style="color: #d55e00; font-weight: bold;">NULL</span>) <span style="color: #56b4e9; font-weight: bold;">return</span>;
    traverseR(h-&gt;next, visit);
    (*visit)(h); 
  }
<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #d55e00;">delete</span>(<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">x</span>, <span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">v</span>)
  { 
    <span style="color: #56b4e9; font-weight: bold;">if</span> (x == <span style="color: #d55e00; font-weight: bold;">NULL</span>) <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #d55e00; font-weight: bold;">NULL</span>;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (eq(x-&gt;item, v))
      { <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">t</span> = x-&gt;next; free(x); <span style="color: #56b4e9; font-weight: bold;">return</span> t; }
    x-&gt;next = delete(x-&gt;next, v);
    <span style="color: #56b4e9; font-weight: bold;">return</span> x;
  }
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgef89d24" class="outline-3">
<h3 id="orgef89d24">5.2 Divide and Conquer</h3>
<div class="outline-text-3" id="text-orgef89d24">
</div>
<div id="outline-container-org7f0e86e" class="outline-4">
<h4 id="org7f0e86e">Program 5.6 Divide-and-conquer to find the maximum</h4>
<div class="outline-text-4" id="text-org7f0e86e">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">Divide-and-conquer to find the maximum </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #d55e00;">max</span>(<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">a</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">l</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">r</span>)
{
    <span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">u</span>, <span style="color: #e69f00; font-weight: bold;">v</span>;
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">m</span> = (l + r) / 2;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (l == r)
        <span style="color: #56b4e9; font-weight: bold;">return</span> a[l];
    u = max(a, l, m);
    v = max(a, m + 1, r);
    <span style="color: #56b4e9; font-weight: bold;">if</span> (u &gt; v)
        <span style="color: #56b4e9; font-weight: bold;">return</span> u;
    <span style="color: #56b4e9; font-weight: bold;">else</span>
        <span style="color: #56b4e9; font-weight: bold;">return</span> v;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd339c05" class="outline-4">
<h4 id="orgd339c05">Program 5.7 Solution to the towers of Hanoi</h4>
<div class="outline-text-4" id="text-orgd339c05">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">hanoi</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">N</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">d</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">if</span> (N == 0)
        <span style="color: #56b4e9; font-weight: bold;">return</span>;
    hanoi(N - 1, -d);
    shift(N, d);
    hanoi(N - 1, -d);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgee63fbb" class="outline-4">
<h4 id="orgee63fbb">Program 5.8 Divide and conquer to draw a ruler</h4>
<div class="outline-text-4" id="text-orgee63fbb">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #d55e00;">rule</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">l</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">r</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">h</span>)
  { <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">m</span> = (l+r)/2;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (h &gt; 0)
      { 
        rule(l, m, h-1);
        mark(m, h);
        rule(m, r, h-1);
      }
  }
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb46cee" class="outline-4">
<h4 id="orgdb46cee">Program 5.9 Nonrecursive program to draw a ruler</h4>
<div class="outline-text-4" id="text-orgdb46cee">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #d55e00;">rule</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">l</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">r</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">h</span>)
  { 
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>, <span style="color: #e69f00; font-weight: bold;">t</span>;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (t = 1, j = 1; t &lt;= h; j += j, t++)
      <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; l+j+i &lt;= r; i += j+j)
        mark(l+j+i, t);
  }
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc753f39" class="outline-3">
<h3 id="orgc753f39">5.3 Dynamic Programming</h3>
<div class="outline-text-3" id="text-orgc753f39">
</div>
<div id="outline-container-org3dcd86d" class="outline-4">
<h4 id="org3dcd86d">Program 5.10 Fibonacci numbers (recursive implementation)</h4>
<div class="outline-text-4" id="text-org3dcd86d">
<p>
"This program is not usable because it takes exponential time to
compute FN."
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">F</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>)
  { 
    <span style="color: #56b4e9; font-weight: bold;">if</span> (i &lt; 1) <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (i == 1) <span style="color: #56b4e9; font-weight: bold;">return</span> 1;
    <span style="color: #56b4e9; font-weight: bold;">return</span> F(i-1) + F(i-2);
  }
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbb41fb7" class="outline-4">
<h4 id="orgbb41fb7">Program 5.11 Fibonacci numbers (dynamic programming)</h4>
<div class="outline-text-4" id="text-orgbb41fb7">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">F</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>)
  { <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">t</span>;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (knownF[i] != unknown) <span style="color: #56b4e9; font-weight: bold;">return</span> knownF[i];
    <span style="color: #56b4e9; font-weight: bold;">if</span> (i == 0) t = 0;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (i == 1) t = 1;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (i &gt; 1) t = F(i-1) + F(i-2);
    <span style="color: #56b4e9; font-weight: bold;">return</span> knownF[i] = t; 
  }
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc110b57" class="outline-4">
<h4 id="orgc110b57">Program 5.12 Knapsack problem (recursive implementation)</h4>
<div class="outline-text-4" id="text-orgc110b57">
<p>
"do not use this program, because it will take exponential time"
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">knap</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">cap</span>)
  { <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">space</span>, <span style="color: #e69f00; font-weight: bold;">max</span>, <span style="color: #e69f00; font-weight: bold;">t</span>;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0, max = 0; i &lt; N; i++)
      <span style="color: #56b4e9; font-weight: bold;">if</span> ((space = cap-items[i].size) &gt;= 0)
        <span style="color: #56b4e9; font-weight: bold;">if</span> ((t = knap(space) + items[i].val) &gt; max) 
          max = t;
    <span style="color: #56b4e9; font-weight: bold;">return</span> max;     
  }
</pre>
</div>
</div>
</div>
