programming/c/code/algorithms.org
*** Program 5.13 Knapsack problem (dynamic programming)

#+BEGIN_SRC c :mkdirp yes :tangle 5-13.c
int knap(int M)
  { int i, space, max, maxi, t;
    if (maxKnown[M] != unknown) return maxKnown[M];
    for (i = 0, max = 0; i < N; i++)
      if ((space = M-items[i].size) >= 0)
        if ((t = knap(space) + items[i].val) > max)
          { max = t; maxi = i; }
    maxKnown[M] = max; itemKnown[M] = items[maxi];
    return max;     
  }
#+END_SRC

** 5.4 Trees

no code

** 5.5 Mathematical Properties of Binary Trees

no code

** 5.6 Tree Traversal

*** Program 5.14 Recursive tree traversal

#+BEGIN_SRC c :mkdirp yes :tangle 5-14.c
void traverse(link h, void (*visit)(link))
  { 
    if (h == NULL) return;
    (*visit)(h); 
    traverse(h->l, visit);
    traverse(h->r, visit);
  }
#+END_SRC

*** Program 5.15 Preorder traversal (nonrecursive)

#+BEGIN_SRC c
  void traverse(link h, void (*visit)(link))
    {
      STACKinit(max); STACKpush(h);
      while (!STACKempty())
        {
          (*visit)(h = STACKpop());
          if (h->r != NULL) STACKpush(h->r); 
          if (h->l != NULL) STACKpush(h->l); 
        }
    }
#+END_SRC

*** Program 5.16 Level-order traversal

#+BEGIN_SRC c
void traverse(link h, void (*visit)(link))
  {
    QUEUEinit(max); QUEUEput(h);
    while (!QUEUEempty())
      {
        (*visit)(h = QUEUEget());
        if (h->l != NULL) QUEUEput(h->l); 
        if (h->r != NULL) QUEUEput(h->r); 
      }
  }
#+END_SRC

** 5.7 Recursive Binary-Tree Algorithms

*** Program 5.I7 Computation of tree parameters

#+BEGIN_SRC c
  int count(link h)
    { 
      if (h == NULL) return 0;
      return count(h->l) + count(h->r) + 1;
    }
  int height(link h)
    { int u, v;
      if (h == NULL) return -1;
      u = height(h->l); v = height(h->r);
      if (u > v) return u+1; else return v+1;
    }
#+END_SRC

*** Program 5-18 Quick tree-print function

#+BEGIN_SRC c
  void printnode(char c, int h)
    { int i;
      for (i = 0; i < h; i++) printf("  ");
      printf("%c\n", c);
    }
  void show(link x, int h)
    { 
      if (x == NULL) { printnode("*", h); return; }
      show(x->r, h+1);    
      printnode(x->item, h);
      show(x->l, h+1);    
    }
#+END_SRC

*** Program 5.I9 Construction of a tournament

#+BEGIN_SRC c
  typedef struct node *link;
  struct node { Item item; link l, r };
  link NEW(Item item, link l, link r)
    { link x = malloc(sizeof *x); 
      x->item = item; x->l = l; x->r = r;
      return x;
    }
  link max(Item a[], int l, int r)
    { int m = (l+r)/2; Item u, v;
      link x = NEW(a[m], NULL, NULL);
      if (l == r) return x;
      x->l = max(a, l, m);
      x->r = max(a, m+1, r);
      u = x->l->item; v = x->r->item;
      if (u > v) 
        x->item = u; else x->item = v;
      return x;
    }
#+END_SRC

