programming/c/code/algorithms.html

<div id="outline-container-orgaf5f560" class="outline-4">
<h4 id="orgaf5f560">Program 5.13 Knapsack problem (dynamic programming)</h4>
<div class="outline-text-4" id="text-orgaf5f560">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">knap</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">M</span>)
  { <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">space</span>, <span style="color: #e69f00; font-weight: bold;">max</span>, <span style="color: #e69f00; font-weight: bold;">maxi</span>, <span style="color: #e69f00; font-weight: bold;">t</span>;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (maxKnown[M] != unknown) <span style="color: #56b4e9; font-weight: bold;">return</span> maxKnown[M];
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0, max = 0; i &lt; N; i++)
      <span style="color: #56b4e9; font-weight: bold;">if</span> ((space = M-items[i].size) &gt;= 0)
        <span style="color: #56b4e9; font-weight: bold;">if</span> ((t = knap(space) + items[i].val) &gt; max)
          { max = t; maxi = i; }
    maxKnown[M] = max; itemKnown[M] = items[maxi];
    <span style="color: #56b4e9; font-weight: bold;">return</span> max;     
  }
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org938156e" class="outline-3">
<h3 id="org938156e">5.4 Trees</h3>
<div class="outline-text-3" id="text-org938156e">
<p>
no code
</p>
</div>
</div>

<div id="outline-container-org59e12a8" class="outline-3">
<h3 id="org59e12a8">5.5 Mathematical Properties of Binary Trees</h3>
<div class="outline-text-3" id="text-org59e12a8">
<p>
no code
</p>
</div>
</div>

<div id="outline-container-orgf5eb6d5" class="outline-3">
<h3 id="orgf5eb6d5">5.6 Tree Traversal</h3>
<div class="outline-text-3" id="text-orgf5eb6d5">
</div>
<div id="outline-container-org2802b76" class="outline-4">
<h4 id="org2802b76">Program 5.14 Recursive tree traversal</h4>
<div class="outline-text-4" id="text-org2802b76">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">traverse</span>(<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">h</span>, <span style="color: #0072b2; font-weight: bold;">void</span> (*<span style="color: #d55e00;">visit</span>)(<span style="color: #0072b2; font-weight: bold;">link</span>))
  { 
    <span style="color: #56b4e9; font-weight: bold;">if</span> (h == <span style="color: #d55e00; font-weight: bold;">NULL</span>) <span style="color: #56b4e9; font-weight: bold;">return</span>;
    (*visit)(h); 
    traverse(h-&gt;l, visit);
    traverse(h-&gt;r, visit);
  }
</pre>
</div>
</div>
</div>

<div id="outline-container-org9b51410" class="outline-4">
<h4 id="org9b51410">Program 5.15 Preorder traversal (nonrecursive)</h4>
<div class="outline-text-4" id="text-org9b51410">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">traverse</span>(<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">h</span>, <span style="color: #0072b2; font-weight: bold;">void</span> (*<span style="color: #d55e00;">visit</span>)(<span style="color: #0072b2; font-weight: bold;">link</span>))
  {
    STACKinit(max); STACKpush(h);
    <span style="color: #56b4e9; font-weight: bold;">while</span> (!STACKempty())
      {
        (*visit)(h = STACKpop());
        <span style="color: #56b4e9; font-weight: bold;">if</span> (h-&gt;r != <span style="color: #d55e00; font-weight: bold;">NULL</span>) STACKpush(h-&gt;r); 
        <span style="color: #56b4e9; font-weight: bold;">if</span> (h-&gt;l != <span style="color: #d55e00; font-weight: bold;">NULL</span>) STACKpush(h-&gt;l); 
      }
  }
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb2917de" class="outline-4">
<h4 id="orgb2917de">Program 5.16 Level-order traversal</h4>
<div class="outline-text-4" id="text-orgb2917de">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">traverse</span>(<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">h</span>, <span style="color: #0072b2; font-weight: bold;">void</span> (*<span style="color: #d55e00;">visit</span>)(<span style="color: #0072b2; font-weight: bold;">link</span>))
  {
    QUEUEinit(max); QUEUEput(h);
    <span style="color: #56b4e9; font-weight: bold;">while</span> (!QUEUEempty())
      {
        (*visit)(h = QUEUEget());
        <span style="color: #56b4e9; font-weight: bold;">if</span> (h-&gt;l != <span style="color: #d55e00; font-weight: bold;">NULL</span>) QUEUEput(h-&gt;l); 
        <span style="color: #56b4e9; font-weight: bold;">if</span> (h-&gt;r != <span style="color: #d55e00; font-weight: bold;">NULL</span>) QUEUEput(h-&gt;r); 
      }
  }
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org594ee5c" class="outline-3">
<h3 id="org594ee5c">5.7 Recursive Binary-Tree Algorithms</h3>
<div class="outline-text-3" id="text-org594ee5c">
</div>
<div id="outline-container-orgcd412d7" class="outline-4">
<h4 id="orgcd412d7">Program 5.I7 Computation of tree parameters</h4>
<div class="outline-text-4" id="text-orgcd412d7">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">count</span>(<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">h</span>)
  { 
    <span style="color: #56b4e9; font-weight: bold;">if</span> (h == <span style="color: #d55e00; font-weight: bold;">NULL</span>) <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
    <span style="color: #56b4e9; font-weight: bold;">return</span> count(h-&gt;l) + count(h-&gt;r) + 1;
  }
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">height</span>(<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">h</span>)
  { <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">u</span>, <span style="color: #e69f00; font-weight: bold;">v</span>;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (h == <span style="color: #d55e00; font-weight: bold;">NULL</span>) <span style="color: #56b4e9; font-weight: bold;">return</span> -1;
    u = height(h-&gt;l); v = height(h-&gt;r);
    <span style="color: #56b4e9; font-weight: bold;">if</span> (u &gt; v) <span style="color: #56b4e9; font-weight: bold;">return</span> u+1; <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">return</span> v+1;
  }
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbfbdffe" class="outline-4">
<h4 id="orgbfbdffe">Program 5-18 Quick tree-print function</h4>
<div class="outline-text-4" id="text-orgbfbdffe">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">printnode</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">c</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">h</span>)
  { <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; h; i++) printf(<span style="color: #848ea9;">"  "</span>);
    printf(<span style="color: #848ea9;">"%c\n"</span>, c);
  }
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">show</span>(<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">x</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">h</span>)
  { 
    <span style="color: #56b4e9; font-weight: bold;">if</span> (x == <span style="color: #d55e00; font-weight: bold;">NULL</span>) { printnode(<span style="color: #848ea9;">"*"</span>, h); <span style="color: #56b4e9; font-weight: bold;">return</span>; }
    show(x-&gt;r, h+1);    
    printnode(x-&gt;item, h);
    show(x-&gt;l, h+1);    
  }
</pre>
</div>
</div>
</div>

<div id="outline-container-org81a46dd" class="outline-4">
<h4 id="org81a46dd">Program 5.I9 Construction of a tournament</h4>
<div class="outline-text-4" id="text-org81a46dd">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">node</span> *<span style="color: #0072b2; font-weight: bold;">link</span>;
<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">node</span> { <span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">item</span>; <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">l</span>, <span style="color: #e69f00; font-weight: bold;">r</span> };
<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #d55e00;">NEW</span>(<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">item</span>, <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">l</span>, <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">r</span>)
  { <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">x</span> = malloc(<span style="color: #56b4e9; font-weight: bold;">sizeof</span> *x); 
    x-&gt;item = item; x-&gt;l = l; x-&gt;r = r;
    <span style="color: #56b4e9; font-weight: bold;">return</span> x;
  }
<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #d55e00;">max</span>(<span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">a</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">l</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">r</span>)
  { <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">m</span> = (l+r)/2; <span style="color: #0072b2; font-weight: bold;">Item</span> <span style="color: #e69f00; font-weight: bold;">u</span>, <span style="color: #e69f00; font-weight: bold;">v</span>;
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">x</span> = NEW(a[m], <span style="color: #d55e00; font-weight: bold;">NULL</span>, <span style="color: #d55e00; font-weight: bold;">NULL</span>);
    <span style="color: #56b4e9; font-weight: bold;">if</span> (l == r) <span style="color: #56b4e9; font-weight: bold;">return</span> x;
    x-&gt;l = max(a, l, m);
    x-&gt;r = max(a, m+1, r);
    u = x-&gt;l-&gt;item; v = x-&gt;r-&gt;item;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (u &gt; v) 
      x-&gt;item = u; <span style="color: #56b4e9; font-weight: bold;">else</span> x-&gt;item = v;
    <span style="color: #56b4e9; font-weight: bold;">return</span> x;
  }
</pre>
</div>
</div>
</div>
