programming/c/code/algorithms.org
*** Program 5.20 Construction of a parse tree

#+BEGIN_SRC c
  char *a; int i;
  typedef struct Tnode* link;
  struct Tnode { char token; link l, r; };
  link NEW(char token, link l, link r)
    { link x = malloc(sizeof *x); 
      x->token = token; x->l = l; x->r = r;
      return x;
    }
  link parse()
    { char t = a[i++];
      link x = NEW(t, NULL, NULL);
      if ((t == '+') || (t == '*'))
        { x->l = parse(); x->r = parse(); }
      return x;
    }
#+END_SRC

** 5.8 Graph Traversal

*** Program 5.21 Depth-first search

#+BEGIN_SRC c
void traverse(int k, void (*visit)(int))
  { link t;
    (*visit)(k); visited[k] = 1;
    for (t = adj[k]; t != NULL; t = t->next)
      if (!visited[t->v]) traverse(t->v, visit);
  }
#+END_SRC

*** Program 5.22 Breadth-first search

#+BEGIN_SRC c
  void traverse(int k, void (*visit)(int))
    { link t;
      QUEUEinit(V); QUEUEput(k);
      while (!QUEUEempty())
        if (visited[k = QUEUEget()] == 0)
          {
            (*visit)(k); visited[k] = 1;
            for (t = adj[k]; t != NULL; t = t->next)
              if (visited[t->v] == 0) QUEUEput(t->v);
          }
    }
#+END_SRC

