programming/c/code/algorithms.html

<div id="outline-container-org916df5d" class="outline-4">
<h4 id="org916df5d">Program 5.20 Construction of a parse tree</h4>
<div class="outline-text-4" id="text-org916df5d">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">a</span>; <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;
<span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">Tnode</span>* <span style="color: #0072b2; font-weight: bold;">link</span>;
<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">Tnode</span> { <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">token</span>; <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">l</span>, <span style="color: #e69f00; font-weight: bold;">r</span>; };
<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #d55e00;">NEW</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">token</span>, <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">l</span>, <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">r</span>)
  { <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">x</span> = malloc(<span style="color: #56b4e9; font-weight: bold;">sizeof</span> *x); 
    x-&gt;token = token; x-&gt;l = l; x-&gt;r = r;
    <span style="color: #56b4e9; font-weight: bold;">return</span> x;
  }
<span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #d55e00;">parse</span>()
  { <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">t</span> = a[i++];
    <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">x</span> = NEW(t, <span style="color: #d55e00; font-weight: bold;">NULL</span>, <span style="color: #d55e00; font-weight: bold;">NULL</span>);
    <span style="color: #56b4e9; font-weight: bold;">if</span> ((t == <span style="color: #848ea9;">'+'</span>) || (t == <span style="color: #848ea9;">'*'</span>))
      { x-&gt;l = parse(); x-&gt;r = parse(); }
    <span style="color: #56b4e9; font-weight: bold;">return</span> x;
  }
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org11d87b9" class="outline-3">
<h3 id="org11d87b9">5.8 Graph Traversal</h3>
<div class="outline-text-3" id="text-org11d87b9">
</div>
<div id="outline-container-org7072a75" class="outline-4">
<h4 id="org7072a75">Program 5.21 Depth-first search</h4>
<div class="outline-text-4" id="text-org7072a75">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">traverse</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">k</span>, <span style="color: #0072b2; font-weight: bold;">void</span> (*<span style="color: #d55e00;">visit</span>)(<span style="color: #0072b2; font-weight: bold;">int</span>))
  { <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">t</span>;
    (*visit)(k); visited[k] = 1;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (t = adj[k]; t != <span style="color: #d55e00; font-weight: bold;">NULL</span>; t = t-&gt;next)
      <span style="color: #56b4e9; font-weight: bold;">if</span> (!visited[t-&gt;v]) traverse(t-&gt;v, visit);
  }
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ea6351" class="outline-4">
<h4 id="org7ea6351">Program 5.22 Breadth-first search</h4>
<div class="outline-text-4" id="text-org7ea6351">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">traverse</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">k</span>, <span style="color: #0072b2; font-weight: bold;">void</span> (*<span style="color: #d55e00;">visit</span>)(<span style="color: #0072b2; font-weight: bold;">int</span>))
  { <span style="color: #0072b2; font-weight: bold;">link</span> <span style="color: #e69f00; font-weight: bold;">t</span>;
    QUEUEinit(V); QUEUEput(k);
    <span style="color: #56b4e9; font-weight: bold;">while</span> (!QUEUEempty())
      <span style="color: #56b4e9; font-weight: bold;">if</span> (visited[k = QUEUEget()] == 0)
        {
          (*visit)(k); visited[k] = 1;
          <span style="color: #56b4e9; font-weight: bold;">for</span> (t = adj[k]; t != <span style="color: #d55e00; font-weight: bold;">NULL</span>; t = t-&gt;next)
            <span style="color: #56b4e9; font-weight: bold;">if</span> (visited[t-&gt;v] == 0) QUEUEput(t-&gt;v);
        }
  }
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
